
#include "global_vars.h"
#include "blocks.h"
#include "levels.h"
#include "main.h"

void stagecls()
{
	for (t = 0; t < smax; t++)
	{
		GroundX[t] = -9000000;
		GroundY[t] = 1;
		GroundSizeX[t] = 1;
		GroundSizeY[t] = 1;
		GroundAI[t] = 0;
		GroundType[t] = EObjectType::VERTICAL_PIPE_BODY;
		GroundSubType[t] = 0;
	}
	// for (t=0;t<spmax;t++){spa[t]=-9000000;szyunni[t]=t;spb[t]=1;spc[t]=1;spd[t]=1;sptype[t]=0;spgtype[t]=0;}
	for (t = 0; t < tmax; t++)
	{
		BlockX[t] = -9000000;
		BlockY[t] = 1;
		BlockItemCount[t] = 0;
		BlockSubType[t] = EBlockSubType::NONE;
	}
	for (t = 0; t < srmax; t++)
	{
		LiftX[t] = -9000000;
		LiftY[t] = 1;
		LiftSizeX[t] = 1;
		LiftVelY[t] = 0;
		LiftFrictionY[t] = 0;
		srmuki[t] = 0;
		sron[t] = 0;
		sree[t] = 0;
		srsok[t] = 0;
		srmove[t] = 0;
		srmovep[t] = 0;
		LiftType[t] = ELiftType::YELLOW;
	}
	// for (t=0;t<sqmax;t++){sqa[t]=-9000000;sqb[t]=1;sqc[t]=1;sqd[t]=1;sqgtype[t]=0;sqtype[t]=0;}
	// for (t=0;t<kmax;t++){ka[t]=-9000000;kmuki[t]=0;ksoka[t]=0;ksokb[t]=0;kxsoka[t]=0;kxsokb[t]=0;}
	// for (t=0;t<imax;t++){ia[t]=-9000000;ib[t]=1;ic[t]=1;id[t]=1;}
	for (t = 0; t < amax; t++)
	{
		EnemyX[t] = -9000000;
		EnemyY[t] = 1;
		EnemyVelX[t] = 0;
		EnemyVelY[t] = 1;
		azimentype[t] = 0;
		EnemyType[t] = EEnemyType::BALL;
		EnemySubType[t] = EEnemySubType::NONE;
		af[t] = 0;
		EnemyAITimer[t] = 0;
		EnemyBlockAppearTimer[t] = 0;
		EnemyMessageTimer[t] = 0;
	}
	for (t = 0; t < bmax; t++)
	{
		EnemyAppearX[t] = -9000000;
		EnemyAppearY[t] = 1;
		bz[t] = 1;
		EnemyAppearTimer[t] = 0;
		EnemyAppearSubType[t] = EEnemySubType::NONE;
	}
	for (t = 0; t < emax; t++)
	{
		ExtraGraphicX[t] = -9000000;
		ExtraGraphicY[t] = 1;
		ExtraGraphicVelX[t] = 1;
		ExtraGraphicVelY[t] = 1;
		ExtraGraphicType[t] = 0;
	}
	for (t = 0; t < nmax; t++)
	{
		BackgroundX[t] = -9000000;
		BackgroundY[t] = 1;
		BackgroundWidth[t] = 1;
		BackgroundHeight[t] = 1;
		BackgroundType[t] = EDecorationType::HILL;
	}
	// for (t=0;t<cmax;t++){ca[t]=-9000000;cb[t]=1;contm[t]=0;ctype[t]=0;ce[t]=0;cf[t]=0;}
	// for (t=0;t<vmax;t++){va[t]=-9000000;vtype[t]=0;vb[t]=0;vc[t]=1;vd[t]=1;}
	// for (t=0;t<gmax;t++){ga[t]=-9000000;gx[t]=0;gstring[t]="";}

	GroundCount = 0;
	BlockCount = 0;
	EnemyCount = 0;
	EnemyAppearCount = 0;
	ExtraGraphicCount = 0;
	BackgroundCount = 0;
	// haikeitouroku();
} // stagecls()

// ステージロード (Stage Load)
void stage()
{

	// fzx=6000*100;
	scrollx = 3600 * 100;

	// byte stagedate[16][801];
	// byte stagedate2[16][801];

	// 1-レンガ,2-コイン,3-空,4-土台//5-6地面//7-隠し// (1-Brick, 2-Coin, 3-Empty, 4-Foundation // 5-6 Ground // 7-Hidden //)

	stagep();

	for (tt = 0; tt <= 1000; tt++)
	{
		for (t = 0; t <= 16; t++)
		{
			xx[10] = 0;
			if (stagedate[t][tt] >= 1 && stagedate[t][tt] <= 255)
				xx[10] = (int)stagedate[t][tt];
			xx[21] = tt * 29;
			xx[22] = t * 29 - 12;
			xx[23] = xx[10];
			if (xx[10] >= 1 && xx[10] <= 19 && xx[10] != 9)
			{
				BlockCreate(tt * 29, t * 29 - 12, (EBlockType)xx[10]);
			}
			if (xx[10] >= 20 && xx[10] <= 29)
			{
				LiftX[LiftCount] = xx[21] * 100;
				LiftY[LiftCount] = xx[22] * 100;
				LiftSizeX[LiftCount] = 3000;
				srtype[LiftCount] = 0;
				LiftCount++;
				if (LiftCount >= srmax)
					LiftCount = 0;
			}
			if (xx[10] == 30)
			{
				GroundX[GroundCount] = xx[21] * 100;
				GroundY[GroundCount] = xx[22] * 100;
				GroundSizeX[GroundCount] = 3000;
				GroundSizeY[GroundCount] = 6000;
				GroundType[GroundCount] = EObjectType::CHECKPOINT;
				GroundCount++;
				if (GroundCount >= smax)
					GroundCount = 0;
			}
			if (xx[10] == 40)
			{
				GroundX[GroundCount] = xx[21] * 100;
				GroundY[GroundCount] = xx[22] * 100;
				GroundSizeX[GroundCount] = 6000;
				GroundSizeY[GroundCount] = 3000;
				GroundType[GroundCount] = EObjectType::VERTICAL_PIPE_HEAD;
				GroundCount++;
				if (GroundCount >= smax)
					GroundCount = 0;
			}
			if (xx[10] == 41)
			{
				GroundX[GroundCount] = xx[21] * 100 + 500;
				GroundY[GroundCount] = xx[22] * 100;
				GroundSizeX[GroundCount] = 5000;
				GroundSizeY[GroundCount] = 3000;
				GroundType[GroundCount] = EObjectType::HORIZONTAL_PIPE_BODY;
				GroundCount++;
				if (GroundCount >= smax)
					GroundCount = 0;
			}

			if (xx[10] == 43)
			{
				GroundX[GroundCount] = xx[21] * 100;
				GroundY[GroundCount] = xx[22] * 100 + 500;
				GroundSizeX[GroundCount] = 2900;
				GroundSizeY[GroundCount] = 5300;
				GroundType[GroundCount] = EObjectType::VERTICAL_PIPE_HEAD;
				GroundCount++;
				if (GroundCount >= smax)
					GroundCount = 0;
			}
			if (xx[10] == 44)
			{
				GroundX[GroundCount] = xx[21] * 100;
				GroundY[GroundCount] = xx[22] * 100 + 700;
				GroundSizeX[GroundCount] = 3900;
				GroundSizeY[GroundCount] = 5000;
				GroundType[GroundCount] = EObjectType::HORIZONTAL_PIPE_HEAD;
				GroundCount++;
				if (GroundCount >= smax)
					GroundCount = 0;
			}
			// これなぜかバグの原因ｗ (For some reason, this is the cause of the bug lol)
			if (xx[10] >= 50 && xx[10] <= 79)
			{
				EnemyAppearX[EnemyAppearCount] = xx[21] * 100;
				EnemyAppearY[EnemyAppearCount] = xx[22] * 100;
				EnemyAppearType[EnemyAppearCount] = (EEnemyType)(xx[23] - 50);
				EnemyAppearCount++;
				if (EnemyAppearCount >= bmax)
					EnemyAppearCount = 0;
			}

			if (xx[10] >= 80 && xx[10] <= 89)
			{
				BackgroundX[BackgroundCount] = xx[21] * 100;
				BackgroundY[BackgroundCount] = xx[22] * 100;
				BackgroundType[BackgroundCount] = (EDecorationType)(xx[23] - 80);
				BackgroundCount++;
				if (BackgroundCount >= nmax)
					BackgroundCount = 0;
			}
			// コイン (Coin)
			if (xx[10] == 9)
			{
				BlockCreate(tt * 29, t * 29 - 12, EBlockType::COIN);
			}
			if (xx[10] == 99)
			{
				GroundX[GroundCount] = xx[21] * 100;
				GroundY[GroundCount] = xx[22] * 100;
				GroundSizeX[GroundCount] = 3000;
				GroundSizeY[GroundCount] = (12 - t) * 3000;
				GroundType[GroundCount] = EObjectType::GOAL_POLE;
				GroundCount++;
				if (GroundCount >= smax)
					GroundCount = 0;
			}
		}
	}

	if (CurrentPlayerCheckpoint >= 1)
	{
		xx[17] = 0;
		for (t = 0; t < smax; t++)
		{
			if (GroundType[t] == EObjectType::CHECKPOINT && CurrentPlayerCheckpoint >= 1)
			{
				fx = GroundX[t] - fxmax / 2;
				fzx = fx;
				PlayerX = GroundX[t] - fx;
				PlayerY = GroundY[t] - fy;
				CurrentPlayerCheckpoint--;
				xx[17]++;

				GroundX[t] = -80000000;
			}
		}
		CurrentPlayerCheckpoint += xx[17];
	}
	// BlockCreate(1,2,3);

} // stage()

void stagep()
{

	// ステージロード
	// void stage(){

	// fzx=6000*100;
	scrollx = 3600 * 100;

	// byte stagedate[16][801];
	// byte stagedate2[16][801];

	// 1-レンガ,2-コイン,3-空,4-土台//5-6地面//7-隠し//

	if (currentGame == ESyobonActionGame::SYOBON_ACTION_1_AND_2)
	{
		HandleSyobonActionOneLevels();
		HandleSyobonActionTwoLevels();
	}
	else if (currentGame == ESyobonActionGame::SYOBON_ACTION_3)
	{
		HandleSyobonActionThreeLevels();
	}

} // stagep

void HandleSyobonActionOneLevels()
{
    // 1-1
    if (SyobonWorld == 1 && SyobonLevel == 1 && SyobonSection == 0)
    {
        bgmchange(Music[1]);
        // new byte stagedate[16][801]={

        //                                                                                                                                                                                     中間
        byte stagedatex[17][1001] = {
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             82, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 82,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             98, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 99, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0},
            {0, 0, 0, 0, 0, 0, 82, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 98, 98, 98, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 7,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 4,
             4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             30, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 4,
             4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 4,
             4, 4,
             4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 98, 0, 0, 0, 1, 98, 1, 2, 1, 0,
             0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             7, 0, 0,
             0, 0,
             0, 1, 98, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98, 0, 0, 0,
             0, 0,
             0, 1,
             98, 0, 0, 0, 2, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 2, 1, 0, 0, 0, 0, 0,
             0, 0, 0,
             4, 4,
             4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0},
            {0, 80, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0,
             0, 0,
             40, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 80, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0,
             0, 0, 4,
             0, 7,
             7, 7, 7, 7, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 4,
             4, 4, 4,
             4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 83, 0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             41, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0,
             0, 4, 4,
             0, 0,
             0, 0, 0, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 0, 0, 4,
             4, 4,
             4, 4,
             4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 0, 0, 0, 0, 0, 50, 0,
             0, 81,
             41, 0,
             0, 0, 0, 0, 81, 98, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0,
             0, 0, 81, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50,
             0, 50,
             0, 0,
             51, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 81, 0, 0, 0, 4, 4,
             4, 0,
             0, 0,
             4, 4, 0, 0, 0, 0, 0, 41, 0, 0, 0, 0, 0, 50, 0, 50, 0,
             0, 41,
             0, 4, 4,
             4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 4, 81, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0},
            {5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0,
             0, 0, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0,
             0, 5, 5,
             5, 5,
             5, 5, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 0,
             5, 5, 5, 5, 5, 5, 5},
            {6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 0,
             0, 0, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 0, 0, 0, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 0, 0, 0, 0, 0, 6, 6, 6, 6, 6, 6, 6, 6, 0, 0,
             0, 6, 6,
             6, 6,
             6, 6, 0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 0,
             6, 6, 6, 6, 6, 6, 6, 6, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

        // 追加情報
        BlockCreate(8 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_DODGE);
        //BlockSubType[BlockCount] = 2; //+KZ: In Syobon Action by Chiku this block gives a useless mushroom
        BlockCreate(13 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_MUSHROOM);
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_ENEMY_BALL_NORMAL;
        BlockCreate(14 * 29, 5 * 29 - 12, EBlockType::ITEM_BLOCK_ENEMY);
        BlockCreate(35 * 29, 8 * 29 - 12, EBlockType::ITEM_BLOCK_POISON_HIDDEN);
        BlockCreate(47 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_MUSHROOM_2);
        BlockCreate(59 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_COINS);
        BlockCreate(67 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_STAR);

        GroundCount = 0;
        t = GroundCount;
        GroundX[t] = 20 * 29 * 100 + 500;
        GroundY[t] = -6000;
        GroundSizeX[t] = 5000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_SEAL_UP;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 54 * 29 * 100 - 500;
        GroundY[t] = -6000;
        GroundSizeX[t] = 7000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_SEAL_DOWN;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 112 * 29 * 100 + 1000;
        GroundY[t] = -6000;
        GroundSizeX[t] = 3000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_GENERIC_1;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 117 * 29 * 100;
        GroundY[t] = (2 * 29 - 12) * 100 - 1500;
        GroundSizeX[t] = 15000;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::TRIGGER_LASER;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 125 * 29 * 100;
        GroundY[t] = -6000;
        GroundSizeX[t] = 9000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_SEAL_DOWN;
        GroundCount++;
        // t=sco;sa[t]=77*29*100;sb[t]=(6*29-12)*100-1500;sc[t]=12000;sd[t]=3000;stype[t]=103;sco++;
        t = 28;
        GroundX[t] = 29 * 29 * 100 + 500;
        GroundY[t] = (9 * 29 - 12) * 100;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 12000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 49 * 29 * 100;
        GroundY[t] = (5 * 29 - 12) * 100;
        GroundSizeX[t] = 9000 - 1;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::FALLING_BLOCKS;
        GroundAI[t] = 0;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 72 * 29 * 100;
        GroundY[t] = (13 * 29 - 12) * 100;
        GroundSizeX[t] = 3000 * 5 - 1;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::FALLING_FLOOR;
        GroundCount++;

        EnemyAppearCount = 0;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 27 * 29 * 100;
        EnemyAppearY[t] = (9 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::BALL;
        EnemyAppearSubType[t] = EEnemySubType::BALL_UNSTOMPABLE; //+KZ: In Syobon Action by Chiku you can not stomp this enemy
        EnemyAppearCount++;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 103 * 29 * 100;
        EnemyAppearY[t] = (5 * 29 - 12 + 10) * 100;
        EnemyAppearType[t] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[t] = EEnemySubType::EVIL_CLOUD_NORMAL;
        EnemyAppearCount++;
        // t=bco;ba[t]=13*29*100;bb[t]=(5*29-12)*100;btype[t]=81;bxtype[t]=0;bco++;

        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }

    } // sta1

    // 1-2(地上)
    if (SyobonWorld == 1 && SyobonLevel == 2 && SyobonSection == 0)
    {

        // マリ　地上　入れ
        // Mix_HaltMusic();
        bgmchange(Music[1]);
        // PlaySoundMem(oto[0],DX_PLAYTYPE_LOOP) ;

        scrollx = 0 * 100;
        // ma=3000;mb=3000;

        byte stagedatex[17][1001] = {
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 7},
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                83,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                44,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0,
             0, 0, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0,
             0, 5, 5,
             5, 5,
             5, 5, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 0,
             5, 5, 5, 5, 5, 5, 5},
            {6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 0,
             0, 0, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 0, 0, 0, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 0, 0, 0, 0, 0, 6, 6, 6, 6, 6, 6, 6, 6, 0, 0,
             0, 6, 6,
             6, 6,
             6, 6, 0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 0,
             6, 6, 6, 6, 6, 6, 6, 6, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

        BlockCount = 0;
        // ヒント1
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_1_2_0;
        BlockCreate(4 * 29, 9 * 29 - 12, EBlockType::MESSAGE_BLOCK);
        // BlockCreate(7*29,9*29-12,300);

        // 毒1
        BlockCreate(13 * 29, 8 * 29 - 12, EBlockType::ITEM_BLOCK_TRAP_HIDDEN);

        // t=28;
        GroundCount = 0;
        t = GroundCount;
        GroundX[t] = 14 * 29 * 100 + 500;
        GroundY[t] = (9 * 29 - 12) * 100;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 12000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[t] = 1;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 12 * 29 * 100;
        GroundY[t] = (11 * 29 - 12) * 100;
        GroundSizeX[t] = 3000;
        GroundSizeY[t] = 6000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_HORIZONTAL_PIPE_HEAD;
        GroundSubType[t] = 0;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 14 * 29 * 100 + 1000;
        GroundY[t] = -6000;
        GroundSizeX[t] = 5000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_SEAL_UP;
        GroundSubType[t] = 1;
        GroundCount++;

        // ブロックもどき
        // t=bco;ba[t]=7*29*100;bb[t]=(9*29-12)*100;btype[t]=82;bxtype[t]=0;bco++;

        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }

    } // sta2

    // 1-2-1(地下)
    if (SyobonWorld == 1 && SyobonLevel == 2 && SyobonSection == 1)
    {

        // マリ　地下　入れ
        bgmchange(Music[2]);

        scrollx = 4080 * 100;
        PlayerX = 6000;
        PlayerY = 3000;
        StageColor = ELevelType::UNDERGROUND;

        byte stagedatex[17][1001] = {
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 97, 0, 0, 0, 0, 0, 0},
            {1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 1, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 1, 1,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 98, 0,
             1, 1,
             1, 1, 1,
             1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0,
             0, 1, 0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 1, 0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 1, 0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 1, 0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 4, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 1, 0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 1, 0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 97, 44, 0, 0,
             1, 1,
             1, 1,
             1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 1,
             0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 7, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 54, 0, 1,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 97, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 7, 7, 7, 7, 7, 0, 0, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 1, 0},
            {1, 0, 0, 0, 0, 0, 0, 98, 2, 2, 98, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             4, 7,
             7, 7, 7, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 98, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 4, 4, 4, 4,
             1, 1, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 1,
             0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 4,
             0, 0,
             0, 0, 4, 0, 4, 0, 51, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 1, 1, 4, 4, 4, 4, 1,
             1, 1, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1,
             1, 1, 1,
             1, 1,
             1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 1, 0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0,
             4, 0, 4,
             0, 0,
             0, 0, 4, 0, 4, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 40, 0, 0, 0, 0, 0, 0, 30, 0, 0,
             0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 4, 4, 4, 4,
             1, 1, 1,
             1, 0,
             0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 1,
             0},
            {1, 0, 7, 0, 0, 0, 0, 0, 0, 0, 50, 0, 50, 0, 4, 0, 4, 0,
             4, 0,
             4, 0,
             50, 0, 0, 4, 0, 4, 0, 4, 0, 4, 0, 0, 0, 0, 50, 50, 50,
             7, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 41, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 4, 4, 4,
             4, 1, 1,
             1, 1,
             1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
             1, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             1, 0},
            {5, 5, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 0,
             0, 0,
             5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5, 5, 0, 0, 5, 5, 0, 0,
             0, 0, 5,
             5, 5,
             5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1,
             1, 1, 1,
             1, 1,
             1, 1, 1, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 0},
            {6, 6, 0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 0,
             0, 0,
             6, 6, 6, 0, 0, 0, 6, 6, 6, 6, 6, 6, 0, 0, 6, 6, 0, 0,
             0, 0, 6,
             6, 6,
             6, 6, 6, 0, 0, 0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1,
             1, 1, 1,
             1, 1,
             1, 1, 1, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 0,
             0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
        };
        //{ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 6, 6, 0, 6, 6, 6, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}

        BlockCount = 0;
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_MUSHROOM_GROW;
        BlockCreate(7 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_MUSHROOM);
        BlockCreate(10 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_ENEMY);

        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_TRAP_HIDDEN_BRITTLE;
        BlockCreate(49 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_TRAP_HIDDEN);

        for (t = 0; t >= -7; t--)
        {
            BlockCreate(53 * 29, t * 29 - 12, EBlockType::BRICK);
        }

        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_STAR_NORMAL;
        BlockCreate(80 * 29, 5 * 29 - 12, EBlockType::ITEM_BLOCK_STAR);
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_MUSHROOM_GROW;
        BlockCreate(78 * 29, 5 * 29 - 12, EBlockType::ITEM_BLOCK_MUSHROOM);

        // txtype[tco]=1;BlockCreate(11*29,9*29-12,114);//毒1

        GroundCount = 0;
        t = GroundCount;
        GroundX[t] = 2 * 29 * 100;
        GroundY[t] = (13 * 29 - 12) * 100;
        GroundSizeX[t] = 3000 * 1 - 1;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::FALLING_FLOOR;
        GroundCount++;
        // t=sco;sa[t]=19*29*100;sb[t]=(13*29-12)*100;sc[t]=3000*1-1;sd[t]=3000;stype[t]=52;sco++;
        t = GroundCount;
        GroundX[t] = 24 * 29 * 100;
        GroundY[t] = (13 * 29 - 12) * 100;
        GroundSizeX[t] = 3000 * 1 - 1;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::FALLING_FLOOR;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 43 * 29 * 100 + 500;
        GroundY[t] = -6000;
        GroundSizeX[t] = 3000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_GENERIC_1;
        GroundSubType[t] = 1;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 53 * 29 * 100 + 500;
        GroundY[t] = -6000;
        GroundSizeX[t] = 3000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_GENERIC_1;
        GroundSubType[t] = 2;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 129 * 29 * 100;
        GroundY[t] = (7 * 29 - 12) * 100;
        GroundSizeX[t] = 3000;
        GroundSizeY[t] = 6000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_HORIZONTAL_PIPE_HEAD;
        GroundSubType[t] = 2;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 154 * 29 * 100;
        GroundY[t] = 3000;
        GroundSizeX[t] = 9000;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::TRIGGER_GENERIC_1;
        GroundSubType[t] = 7;
        GroundCount++;

        // ブロックもどき

        t = 27;
        GroundX[t] = 69 * 29 * 100;
        GroundY[t] = (1 * 29 - 12) * 100;
        GroundSizeX[t] = 9000 * 2 - 1;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::FALLING_BLOCKS;
        GroundSubType[t] = 0;
        GroundAI[t] = 0;
        GroundCount++;
        t = 28;
        GroundX[t] = 66 * 29 * 100;
        GroundY[t] = (1 * 29 - 12) * 100;
        GroundSizeX[t] = 9000 - 1;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::FALLING_BLOCKS;
        GroundSubType[t] = 1;
        GroundAI[t] = 0;
        GroundCount++;
        t = 29;
        GroundX[t] = 66 * 29 * 100;
        GroundY[t] = (-2 * 29 - 12) * 100;
        GroundSizeX[t] = 9000 * 3 - 1;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::FALLING_BLOCKS;
        GroundSubType[t] = 2;
        GroundAI[t] = 0;
        GroundCount++;

        // 26 ファイアー土管
        t = 26;
        GroundX[t] = 103 * 29 * 100 - 1500;
        GroundY[t] = (9 * 29 - 12) * 100 - 2000;
        GroundSizeX[t] = 3000;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::TRIGGER_LAVA_SPAWNER;
        GroundSubType[t] = 0;
        GroundVelY[t] = 0;
        GroundAI[t] = 48;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 102 * 29 * 100;
        GroundY[t] = (9 * 29 - 12) * 100;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 12000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[t] = 2;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 123 * 29 * 100;
        GroundY[t] = (9 * 29 - 12) * 100;
        GroundSizeX[t] = 3000 * 5 - 1;
        GroundSizeY[t] = 3000 * 5;
        GroundType[t] = EObjectType::FALLING_FLOOR;
        GroundSubType[t] = 1;
        GroundCount++;

        t = GroundCount;
        GroundX[t] = 131 * 29 * 100;
        GroundY[t] = (1 * 29 - 12) * 100;
        GroundSizeX[t] = 4700;
        GroundSizeY[t] = 3000 * 8 - 700;
        GroundType[t] = EObjectType::VERTICAL_PIPE_HEAD;
        GroundSubType[t] = 0;
        GroundCount++;

        // t=sco;sa[t]=44*29*100;sb[t]=-6000;sc[t]=9000;sd[t]=70000;stype[t]=102;sco++;

        // オワタゾーン
        t = GroundCount;
        GroundX[t] = 143 * 29 * 100;
        GroundY[t] = (9 * 29 - 12) * 100;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 12000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[t] = 5;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 148 * 29 * 100;
        GroundY[t] = (9 * 29 - 12) * 100;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 12000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[t] = 5;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 153 * 29 * 100;
        GroundY[t] = (9 * 29 - 12) * 100;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 12000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[t] = 5;
        GroundCount++;

        EnemyAppearCount = 0;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 18 * 29 * 100;
        EnemyAppearY[t] = (10 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[t] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount++;
        // t=bco;ba[t]=52*29*100;bb[t]=(2*29-12)*100;btype[t]=82;bxtype[t]=1;bco++;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 51 * 29 * 100 + 1000;
        EnemyAppearY[t] = (2 * 29 - 12 + 10) * 100;
        EnemyAppearType[t] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[t] = EEnemySubType::EVIL_CLOUD_HIDDEN;
        EnemyAppearCount++;

        // ？ボール
        t = EnemyAppearCount;
        EnemyAppearX[t] = 96 * 29 * 100 + 100;
        EnemyAppearY[t] = (10 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::MYSTERY_BALL;
        EnemyAppearSubType[t] = EEnemySubType::MYSTERY_BALL_LEVEL_1_2;
        EnemyAppearCount++;

        // リフト
        LiftCount = 0;
        t = LiftCount;
        LiftX[t] = 111 * 29 * 100;
        LiftY[t] = (8 * 29 - 12) * 100;
        LiftSizeX[t] = 90 * 100;
        srtype[t] = 0;
        sracttype[t] = 5;
        LiftVelY[t] = -300;
        LiftCount++;
        t = LiftCount;
        LiftX[t] = 111 * 29 * 100;
        LiftY[t] = (0 * 29 - 12) * 100;
        LiftSizeX[t] = 90 * 100;
        srtype[t] = 0;
        sracttype[t] = 5;
        LiftVelY[t] = -300;
        LiftCount++;
        t = 10;
        LiftX[t] = 116 * 29 * 100;
        LiftY[t] = (4 * 29 - 12) * 100;
        LiftSizeX[t] = 90 * 100;
        srtype[t] = 1;
        sracttype[t] = 5;
        LiftVelY[t] = 300;
        LiftCount++;
        t = 11;
        LiftX[t] = 116 * 29 * 100;
        LiftY[t] = (12 * 29 - 12) * 100;
        LiftSizeX[t] = 90 * 100;
        srtype[t] = 1;
        sracttype[t] = 5;
        LiftVelY[t] = 300;
        LiftCount++;

        // ヒント1
        // BlockCreate(4*29,9*29-12,300);
        // BlockCreate(7*29,9*29-12,300);

        // 毒1
        // BlockCreate(13*29,8*29-12,114);

        // t=28;
        // sco=0;
        // t=sco;
        // sa[t]=14*29*100+500;sb[t]=(9*29-12)*100;sc[t]=6000;sd[t]=12000-200;stype[t]=50;sxtype[t]=1;sco++;

        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
        // stagedatex[0][0];

    } // sta1-2-1

    // 1-2(地上)
    if (SyobonWorld == 1 && SyobonLevel == 2 && SyobonSection == 2)
    {

        // マリ　地上　入れ
        // Mix_HaltMusic();
        bgmchange(Music[1]);
        // PlaySoundMem(oto[0],DX_PLAYTYPE_LOOP) ;

        scrollx = 900 * 100;
        PlayerX = 7500;
        PlayerY = 3000 * 9;

        byte stagedatex[17][1001] = {
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                82,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 99, 0, 0, 0, 0, 0, 0, 0, 0, 0, 82, 0, 0, 0, 0,
             0},
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                4,
                4,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                4,
                4,
                4,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                4,
                4,
                4,
                4,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                4,
                4,
                4,
                4,
                4,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                4,
                4,
                4,
                4,
                4,
                4,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                83,
                0,
                0,
            },
            {
                0,
                0,
                40,
                0,
                0,
                0,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                41,
                0,
                0,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                4,
                0,
                0,
                0,
                0,
                0,
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                81,
            },
            {5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0,
             0, 5, 5,
             5, 5,
             5, 5, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 0,
             5, 5, 5, 5, 5, 5, 5},
            {6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 0, 0, 0, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 0, 0, 0, 0, 0, 6, 6, 6, 6, 6, 6, 6, 6, 0, 0,
             0, 6, 6,
             6, 6,
             6, 6, 0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 0,
             6, 6, 6, 6, 6, 6, 6, 6, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

        /*
        //毒1
        BlockCreate(13*29,8*29-12,114);

        //t=28;
        sco=0;
        t=sco;sa[t]=14*29*100+500;sb[t]=(9*29-12)*100;sc[t]=6000;sd[t]=12000-200;stype[t]=50;sxtype[t]=1;sco++;
        t=sco;sa[t]=12*29*100;sb[t]=(11*29-12)*100;sc[t]=3000;sd[t]=6000-200;stype[t]=40;sxtype[t]=0;sco++;
        t=sco;sa[t]=14*29*100+1000;sb[t]=-6000;sc[t]=5000;sd[t]=70000;stype[t]=100;sxtype[t]=1;sco++;
        */

        t = GroundCount;
        GroundX[t] = 5 * 29 * 100 + 500;
        GroundY[t] = -6000;
        GroundSizeX[t] = 3000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_GENERIC_1;
        GroundSubType[t] = 8;
        GroundCount++;
        // 空飛ぶ土管
        t = 28;
        GroundX[t] = 44 * 29 * 100 + 500;
        GroundY[t] = (10 * 29 - 12) * 100;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 9000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundCount++;

        // ポールもどき
        EnemyAppearCount = 0;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 19 * 29 * 100;
        EnemyAppearY[t] = (2 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::FAKE_POLE;
        EnemyAppearSubType[t] = EEnemySubType::FAKE_POLE_STAY;
        EnemyAppearCount++;

        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }

    } // sta2

    // 必要BGM+SE

    // 1-3(地上)
    if (SyobonWorld == 1 && SyobonLevel == 3 && SyobonSection == 6)
    {
        SyobonSection = 0;
    }
    if (SyobonWorld == 1 && SyobonLevel == 3 && SyobonSection == 0)
    {

        // Mix_HaltMusic();
        bgmchange(Music[1]);
        // PlaySoundMem(oto[0],DX_PLAYTYPE_LOOP) ;

        scrollx = 3900 * 100;
        // ma=3000;mb=3000;

        byte stagedatex[17][1001] = {//                                                                                                                                                                                     中間
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 97,
                                      0, 0, 0,
                                      0, 0, 97, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 82, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 97, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 84, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 57, 0, 0, 0, 84, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 84, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 54, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      82, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 84, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 51, 0, 0, 0, 84,
                                      0, 0,
                                      0, 0,
                                      0, 99, 0, 0, 0, 0, 0, 0, 82, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      97, 0, 0,
                                      0, 0, 0, 0, 57, 0, 0, 0, 0, 0, 0, 0, 97, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 58, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 1,
                                      1, 1,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 56, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      30, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      7, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 2, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      84, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 83, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 84, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      1, 1, 1,
                                      1, 1,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 83, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 97,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 97, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 30, 0, 0,
                                      0, 0,
                                      0, 0,
                                      85, 85, 0, 0, 0, 0, 0, 0, 0, 97, 0, 0, 0, 0, 4, 4, 4,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 81, 0, 0, 0, 0, 0, 0, 0, 0, 0, 81, 0, 0,
                                      0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 81, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
                                      81, 0,
                                      0, 0,
                                      0, 50, 0, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4,
                                      0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      81, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0},
                                     {5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5, 5,
                                      0, 0, 0,
                                      5, 5,
                                      5, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 5, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0},
                                     {
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         0,
                                         0,
                                         0,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         0,
                                         0,
                                         0,
                                         6,
                                         6,
                                         6,
                                         0,
                                         0,
                                         0,
                                         6,
                                         6,
                                         6,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         0,
                                         0,
                                         0,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         0,
                                         0,
                                         0,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         6,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                         0,
                                     },
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

        BlockCount = 0;
        BlockCreate(22 * 29, 3 * 29 - 12, EBlockType::BRICK);
        // 毒1
        BlockCreate(54 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_PSWITCH);
        // 音符+ (Musical note+)
        BlockCreate(18 * 29, 14 * 29 - 12, EBlockType::NOTE_BLOCK);
        BlockCreate(19 * 29, 14 * 29 - 12, EBlockType::NOTE_BLOCK);
        BlockCreate(20 * 29, 14 * 29 - 12, EBlockType::NOTE_BLOCK);
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_ENEMY_BALL_SPIKY_NORMAL;
        BlockCreate(61 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_ENEMY); // 5
        BlockCreate(74 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_HIDDEN);   // 6

        // ヒント2 (Hint 2)
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_1_3_0_1;
        BlockCreate(28 * 29, 9 * 29 - 12, EBlockType::MESSAGE_BLOCK); // 7
        // ファイア
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_ENEMY_BURNING_FLOWER;
        BlockCreate(7 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_ENEMY);
        // ヒント3
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_1_3_0_2;
        BlockCreate(70 * 29, 8 * 29 - 12, EBlockType::MESSAGE_BLOCK); // 9

        // もろいぶろっく×３
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(58 * 29, 13 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(59 * 29, 13 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(60 * 29, 13 * 29 - 12, EBlockType::BRICK_BRITTLE);

        // ヒントブレイク (Hint Break)
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(111 * 29, 6 * 29 - 12, EBlockType::MESSAGE_BLOCK_BREAKABLE);
        // ジャンプ
        BlockSubType[BlockCount] = EBlockSubType::TRAMPOLINE_VISIBLE;
        BlockCreate(114 * 29, 9 * 29 - 12, EBlockType::TRAMPOLINE);

        // ファイア
        // BlockCreate(7*29,9*29-12,101);

        EnemyAppearCount = 0;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 101 * 29 * 100;
        EnemyAppearY[t] = (5 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::BALL_SPIKY;
        EnemyAppearSubType[t] = EEnemySubType::BALL_SPIKY_JUMPER;
        EnemyAppearCount++;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 146 * 29 * 100;
        EnemyAppearY[t] = (10 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::DEFRAG;
        EnemyAppearSubType[t] = EEnemySubType::DEFRAG_GRAB_POLE;
        EnemyAppearCount++;

        t = GroundCount;
        GroundX[t] = 9 * 29 * 100;
        GroundY[t] = (13 * 29 - 12) * 100;
        GroundSizeX[t] = 9000 - 1;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::FALLING_FLOOR;
        GroundCount++;
        // t=sco;sa[t]=58*29*100;sb[t]=(13*29-12)*100;sc[t]=9000-1;sd[t]=3000;stype[t]=52;sco++;

        // 土管
        t = GroundCount;
        GroundX[t] = 65 * 29 * 100 + 500;
        GroundY[t] = (10 * 29 - 12) * 100;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 9000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[t] = 1;
        GroundCount++;
        // t=28;sa[t]=65*29*100;sb[t]=(10*29-12)*100;sc[t]=6000;sd[t]=9000-200;stype[t]=50;sco++;

        // トラップ
        t = GroundCount;
        GroundX[t] = 74 * 29 * 100;
        GroundY[t] = (8 * 29 - 12) * 100 - 1500;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::TRIGGER_LASER;
        GroundSubType[t] = 1;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 96 * 29 * 100 - 3000;
        GroundY[t] = -6000;
        GroundSizeX[t] = 9000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_GENERIC_1;
        GroundSubType[t] = 10;
        GroundCount++;
        // ポール砲
        t = GroundCount;
        GroundX[t] = 131 * 29 * 100 - 1500;
        GroundY[t] = (1 * 29 - 12) * 100 - 3000;
        GroundSizeX[t] = 15000;
        GroundSizeY[t] = 14000;
        GroundType[t] = EObjectType::TRIGGER_MULTI_LASER;
        GroundCount++;

        // ？ボール
        t = EnemyAppearCount;
        EnemyAppearX[t] = 10 * 29 * 100 + 100;
        EnemyAppearY[t] = (11 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::MYSTERY_BALL;
        EnemyAppearSubType[t] = EEnemySubType::MYSTERY_BALL_LEVEL_1_3;
        EnemyAppearCount++;
        // ブロックもどき
        t = EnemyAppearCount;
        EnemyAppearX[t] = 43 * 29 * 100;
        EnemyAppearY[t] = (11 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[t] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount++;
        // t=bco;ba[t]=146*29*100;bb[t]=(12*29-12)*100;btype[t]=82;bxtype[t]=1;bco++;
        // うめぇ
        t = EnemyAppearCount;
        EnemyAppearX[t] = 1 * 29 * 100;
        EnemyAppearY[t] = (2 * 29 - 12 + 10) * 100 - 1000;
        EnemyAppearType[t] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[t] = EEnemySubType::EVIL_CLOUD_NORMAL;
        EnemyAppearCount++;

        // リフト
        LiftCount = 0;
        t = LiftCount;
        LiftX[t] = 33 * 29 * 100;
        LiftY[t] = (3 * 29 - 12) * 100;
        LiftSizeX[t] = 90 * 100;
        srtype[t] = 0;
        sracttype[t] = 0;
        LiftVelY[t] = 0;
        LiftType[t] = ELiftType::BREAKING;
        LiftCount++;
        t = LiftCount;
        LiftX[t] = 39 * 29 * 100 - 2000;
        LiftY[t] = (6 * 29 - 12) * 100;
        LiftSizeX[t] = 90 * 100;
        srtype[t] = 0;
        sracttype[t] = 1;
        LiftVelY[t] = 0;
        LiftCount++;
        t = LiftCount;
        LiftX[t] = 45 * 29 * 100 + 1500;
        LiftY[t] = (10 * 29 - 12) * 100;
        LiftSizeX[t] = 90 * 100;
        srtype[t] = 0;
        sracttype[t] = 0;
        LiftVelY[t] = 0;
        LiftType[t] = ELiftType::PUSH_LEFT;
        LiftCount++;

        t = LiftCount;
        LiftX[t] = 95 * 29 * 100;
        LiftY[t] = (7 * 29 - 12) * 100;
        LiftSizeX[t] = 180 * 100;
        srtype[t] = 0;
        sracttype[t] = 0;
        LiftVelY[t] = 0;
        LiftType[t] = ELiftType::PILLAR;
        LiftCount++;
        t = LiftCount;
        LiftX[t] = 104 * 29 * 100;
        LiftY[t] = (9 * 29 - 12) * 100;
        LiftSizeX[t] = 90 * 100;
        srtype[t] = 0;
        sracttype[t] = 0;
        LiftVelY[t] = 0;
        LiftType[t] = ELiftType::PILLAR_BOUNCY;
        LiftCount++;
        t = LiftCount;
        LiftX[t] = 117 * 29 * 100;
        LiftY[t] = (3 * 29 - 12) * 100;
        LiftSizeX[t] = 90 * 100;
        srtype[t] = 0;
        sracttype[t] = 1;
        LiftVelY[t] = 0;
        LiftType[t] = ELiftType::PILLAR_BRICKS;
        LiftCount++;
        t = LiftCount;
        LiftX[t] = 124 * 29 * 100;
        LiftY[t] = (5 * 29 - 12) * 100;
        LiftSizeX[t] = 210 * 100;
        srtype[t] = 0;
        sracttype[t] = 0;
        LiftVelY[t] = 0;
        LiftType[t] = ELiftType::PILLAR;
        LiftCount++;

        if (stagepoint == 1)
        {
            stagepoint = 0;
            PlayerX = 4500;
            PlayerY = -3000;
            CurrentPlayerCheckpoint = 0;
        }

        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }

    } // sta3

    // 1-3(地下)
    if (SyobonWorld == 1 && SyobonLevel == 3 && SyobonSection == 1)
    {

        // マリ　地上　入れ
        // Mix_HaltMusic();
        bgmchange(Music[2]);
        // PlaySoundMem(oto[0],DX_PLAYTYPE_LOOP) ;

        scrollx = 0 * 100;
        PlayerX = 6000;
        PlayerY = 6000;
        StageColor = ELevelType::UNDERGROUND;

        byte stagedatex[17][1001] = {
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                1,
                0,
                0,
                1,
                1,
                1,
                1,
                1,
                1,
                1,
                1,
                1,
                1,
                1,
                1,
                1,
                1,
            },
            {
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                1,
            },
            {
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                1,
            },
            {
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                1,
            },
            {
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                1,
            },
            {
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                1,
            },
            {
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                1,
            },
            {1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
             0, 0},
            {
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                1,
                0,
            },
            {
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                1,
                0,
            },
            {
                1,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                1,
                0,
            },
            {
                1,
                54,
                0,
                54,
                0,
                54,
                0,
                54,
                0,
                54,
                0,
                54,
                0,
                54,
                0,
                54,
                1,
                0,
            },
            {
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                5,
                1,
                8,
                8,
                8,
                8,
            },
            {6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 1, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

        BlockCount = 0;
        // BlockCreate(15*29,12*29-12,111);

        SyobonSection = 0;

        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }

    } // sta3

    // 1-3(空中)
    if (SyobonWorld == 1 && SyobonLevel == 3 && SyobonSection == 5)
    {

        StageColor = ELevelType::SKY;
        bgmchange(Music[3]);

        scrollx = 0 * 100;
        PlayerX = 3000;
        PlayerY = 33000;

        stagepoint = 1;

        byte stagedatex[17][1001] = {
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {0, 0, 9, 0, 9, 0, 9, 0, 9, 0, 9, 0, 0, 0, 0, 0, 0},
            {
                0,
                0,
                0,
                9,
                0,
                9,
                0,
                9,
                0,
                9,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                9,
                0,
                9,
                0,
                9,
                0,
                9,
                0,
                9,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
            },
            {
                8,
                8,
                8,
                8,
                8,
                8,
                8,
                8,
                8,
                8,
                8,
                8,
                8,
                8,
                0,
                0,
                8,
                8,
                8,
                8,
                8,
            },
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

        GroundCount = 0;
        t = GroundCount;
        GroundX[t] = 14 * 29 * 100 - 5;
        GroundY[t] = (11 * 29 - 12) * 100;
        GroundSizeX[t] = 6000;
        GroundSizeY[t] = 15000 - 200;
        GroundType[t] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[t] = 1;
        GroundCount++;
        // t=sco;sa[t]=12*29*100;sb[t]=(11*29-12)*100;sc[t]=3000;sd[t]=6000-200;stype[t]=40;sxtype[t]=0;sco++;
        // t=sco;sa[t]=14*29*100+1000;sb[t]=-6000;sc[t]=5000;sd[t]=70000;stype[t]=100;sxtype[t]=1;sco++;

        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(12 * 29, 4 * 29 - 12, EBlockType::ITEM_BLOCK_COINS);
        // ヒント3
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_1_3_5;
        BlockCreate(12 * 29, 8 * 29 - 12, EBlockType::MESSAGE_BLOCK);
        // txtype[tco]=0;BlockCreate(13*29,4*29-12,110);

        // stc=0;

        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }

    } // sta5

    // 1-4(地下)
    if (SyobonWorld == 1 && SyobonLevel == 4 && SyobonSection == 0)
    {

        // マリ　地上　入れ
        // Mix_HaltMusic();
        bgmchange(Music[4]);
        // PlaySoundMem(oto[0],DX_PLAYTYPE_LOOP) ;

        scrollx = 4400 * 100;
        PlayerX = 12000;
        PlayerY = 6000;
        StageColor = ELevelType::CASTLE;

        byte stagedatex[17][1001] = {//                                                                                                                                                                                     中間
                                     {5, 5, 5, 0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0,
                                      0, 5, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
                                     {5, 5, 5, 0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0,
                                      0, 5, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      7, 7, 7, 7, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 5, 5, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0},
                                     {5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0,
                                      0, 5, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 5,
                                      5, 5,
                                      5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0,
                                      0, 5, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 5,
                                      5, 5,
                                      5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      60, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 60, 0, 0, 0, 0, 0, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 0, 5, 0, 0,
                                      5, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 5, 3, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0,
                                      5, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      2, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      5, 5, 0,
                                      0, 0,
                                      0, 0, 0, 7, 0, 0, 0, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 5, 5,
                                      0, 0,
                                      0, 3, 0, 0, 0, 5, 5, 0, 0, 0, 0, 0, 7, 7, 2, 2, 7, 5,
                                      5, 5, 5,
                                      0, 0,
                                      0, 3, 0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0,
                                      5, 5, 5,
                                      5, 5,
                                      0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0,
                                      0, 0, 0,
                                      59, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 5, 5,
                                      0, 0,
                                      0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 5, 5,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0,
                                      5, 5, 5,
                                      5, 5,
                                      0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 5, 5, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 5, 5,
                                      0, 0,
                                      0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 5, 5,
                                      0, 0,
                                      0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0,
                                      5, 5, 5,
                                      5, 5,
                                      0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 5, 5, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      0, 0, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 5, 5, 5,
                                      5, 5, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 59, 0, 5,
                                      5, 5,
                                      5, 0, 0,
                                      0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 0, 59, 0, 0, 0, 0, 0, 5,
                                      5, 5,
                                      5, 0, 0,
                                      0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0,
                                      5, 5, 5,
                                      5, 5,
                                      0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 5, 5, 5, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      0, 0, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 0, 5, 0, 0, 0, 0, 0,
                                      0, 0,
                                      0, 0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 5, 5, 5,
                                      5, 5, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 5, 5, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 0, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 5, 5, 5, 5, 5,
                                      5, 5, 5,
                                      5, 5,
                                      0, 0, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
                                      5, 5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 41, 0, 5, 5, 5, 5, 5, 5,
                                      5, 5,
                                      5, 5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 86, 0, 0, 86, 0, 5, 5, 5,
                                      5, 5,
                                      86, 0,
                                      0, 86, 0, 0, 86, 0, 0, 86, 0, 0, 86, 0, 0, 86, 0, 0,
                                      86, 0, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 86, 0, 0, 86, 5,
                                      5, 5,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 86, 5, 5, 5, 5, 5, 86, 0, 0,
                                      86, 0, 0,
                                      5, 5,
                                      5, 5, 5, 5, 5, 86, 0, 0, 86, 5, 5, 5, 5, 86, 0, 0, 86,
                                      0, 5,
                                      5, 5, 5,
                                      5, 5, 5, 5, 5, 5, 86, 0, 5, 5, 86, 0, 0, 86, 0, 0, 86,
                                      0, 0,
                                      86, 0,
                                      0, 86, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
                                      41, 0,
                                      5, 5,
                                      5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
                                      5, 0, 0,
                                      0, 0,
                                      0, 0},
                                     {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                                      0, 0, 0,
                                      0, 0,
                                      0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};

        GroundCount = 0; // sco=140;
        t = GroundCount;
        GroundX[t] = 35 * 29 * 100 - 1500 + 750;
        GroundY[t] = (8 * 29 - 12) * 100 - 1500;
        GroundSizeX[t] = 1500;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::TRIGGER_PLATFORM_SPLIT;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 67 * 29 * 100;
        GroundY[t] = (4 * 29 - 12) * 100;
        GroundSizeX[t] = 9000 - 1;
        GroundSizeY[t] = 3000 * 1 - 1;
        GroundType[t] = EObjectType::FALLING_BLOCKS;
        GroundSubType[t] = 3;
        GroundAI[t] = 0;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 73 * 29 * 100;
        GroundY[t] = (13 * 29 - 12) * 100;
        GroundSizeX[t] = 3000 * 1 - 1;
        GroundSizeY[t] = 3000;
        GroundType[t] = EObjectType::FALLING_FLOOR;
        GroundCount++;
        // t=sco;sa[t]=79*29*100;sb[t]=(13*29-12)*100;sc[t]=30*3*100-1;sd[t]=6000-200;stype[t]=51;sxtype[t]=4;sco++;
        // t=sco;sa[t]=83*29*100;sb[t]=(-2*29-12)*100;sc[t]=30*5*100-1;sd[t]=3000-200;stype[t]=51;sxtype[t]=4;sco++;
        t = GroundCount;
        GroundX[t] = 123 * 29 * 100;
        GroundY[t] = (1 * 29 - 12) * 100;
        GroundSizeX[t] = 30 * 6 * 100 - 1 + 0;
        GroundSizeY[t] = 3000 - 200;
        GroundType[t] = EObjectType::FALLING_BLOCKS;
        GroundSubType[t] = 10;
        GroundCount++;
        // スクロール消し
        t = GroundCount;
        GroundX[t] = 124 * 29 * 100 + 3000;
        GroundY[t] = (2 * 29 - 12) * 100;
        GroundSizeX[t] = 3000 * 1 - 1;
        GroundSizeY[t] = 300000;
        GroundType[t] = EObjectType::TRIGGER_GENERIC_1;
        GroundSubType[t] = 20;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 148 * 29 * 100 + 1000;
        GroundY[t] = (-12 * 29 - 12) * 100;
        GroundSizeX[t] = 3000 * 1 - 1;
        GroundSizeY[t] = 300000;
        GroundType[t] = EObjectType::TRIGGER_GENERIC_1;
        GroundSubType[t] = 30;
        GroundCount++;

        // 3連星
        t = GroundCount;
        GroundX[t] = 100 * 29 * 100 + 1000;
        GroundY[t] = -6000;
        GroundSizeX[t] = 3000;
        GroundSizeY[t] = 70000;
        GroundType[t] = EObjectType::TRIGGER_GENERIC_1;
        GroundSubType[t] = 12;
        GroundCount++;

        // 地面1
        t = GroundCount;
        GroundX[t] = 0 * 29 * 100 - 0;
        GroundY[t] = 9 * 29 * 100 + 1700;
        GroundSizeX[t] = 3000 * 7 - 1;
        GroundSizeY[t] = 3000 * 5 - 1;
        GroundType[t] = EObjectType::CASTLE_BRICKS;
        GroundSubType[t] = 0;
        GroundCount++;
        t = GroundCount;
        GroundX[t] = 11 * 29 * 100;
        GroundY[t] = -1 * 29 * 100 + 1700;
        GroundSizeX[t] = 3000 * 8 - 1;
        GroundSizeY[t] = 3000 * 4 - 1;
        GroundType[t] = EObjectType::CASTLE_BRICKS;
        GroundSubType[t] = 0;
        GroundCount++;

        EnemyAppearCount = 0;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 8 * 29 * 100 - 1400;
        EnemyAppearY[t] = (2 * 29 - 12) * 100 + 500;
        EnemyAppearType[t] = EEnemyType::FALLING_CAT;
        EnemyAppearSubType[t] = EEnemySubType::NONE;
        EnemyAppearCount++;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 42 * 29 * 100 - 1400;
        EnemyAppearY[t] = (-2 * 29 - 12) * 100 + 500;
        EnemyAppearType[t] = EEnemyType::FALLING_CAT;
        EnemyAppearSubType[t] = EEnemySubType::NONE;
        EnemyAppearCount++;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 29 * 29 * 100 + 1500;
        EnemyAppearY[t] = (7 * 29 - 12) * 100 + 1500;
        EnemyAppearType[t] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[t] = (EEnemySubType)105;
        EnemyAppearCount++;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 47 * 29 * 100 + 1500;
        EnemyAppearY[t] = (9 * 29 - 12) * 100 + 1500;
        EnemyAppearType[t] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[t] = (EEnemySubType)110;
        EnemyAppearCount++;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 70 * 29 * 100 + 1500;
        EnemyAppearY[t] = (9 * 29 - 12) * 100 + 1500;
        EnemyAppearType[t] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[t] = (EEnemySubType)105;
        EnemyAppearCount++;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 66 * 29 * 100 + 1501;
        EnemyAppearY[t] = (4 * 29 - 12) * 100 + 1500;
        EnemyAppearType[t] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[t] = (EEnemySubType)101;
        EnemyAppearCount++;
        t = EnemyAppearCount;
        EnemyAppearX[t] = 85 * 29 * 100 + 1501;
        EnemyAppearY[t] = (4 * 29 - 12) * 100 + 1500;
        EnemyAppearType[t] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[t] = (EEnemySubType)105;
        EnemyAppearCount++;

        // ステルスうめぇ
        t = EnemyAppearCount;
        EnemyAppearX[t] = 57 * 29 * 100;
        EnemyAppearY[t] = (2 * 29 - 12 + 10) * 100 - 500;
        EnemyAppearType[t] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[t] = EEnemySubType::EVIL_CLOUD_HIDDEN;
        EnemyAppearCount++;
        // ブロックもどき
        t = EnemyAppearCount;
        EnemyAppearX[t] = 77 * 29 * 100;
        EnemyAppearY[t] = (5 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[t] = EEnemySubType::SPIKY_BLOCK_MESSAGE_BLOCK;
        EnemyAppearCount++;
        // ボス
        t = EnemyAppearCount;
        EnemyAppearX[t] = 130 * 29 * 100;
        EnemyAppearY[t] = (8 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::MOLALLA;
        EnemyAppearSubType[t] = EEnemySubType::MOLALLA_ALIVE;
        EnemyAppearCount++;
        // クックル
        t = EnemyAppearCount;
        EnemyAppearX[t] = 142 * 29 * 100;
        EnemyAppearY[t] = (10 * 29 - 12) * 100;
        EnemyAppearType[t] = EEnemyType::KUKURRU;
        EnemyAppearSubType[t] = EEnemySubType::NONE;
        EnemyAppearCount++;

        // マグマ
        BackgroundCount = 0;
        BackgroundX[BackgroundCount] = 7 * 29 * 100 - 300;
        BackgroundY[BackgroundCount] = 14 * 29 * 100 - 1200;
        BackgroundType[BackgroundCount] = EDecorationType::LAVA;
        BackgroundCount++;
        if (BackgroundCount >= nmax)
            BackgroundCount = 0;
        BackgroundX[BackgroundCount] = 41 * 29 * 100 - 300;
        BackgroundY[BackgroundCount] = 14 * 29 * 100 - 1200;
        BackgroundType[BackgroundCount] = EDecorationType::LAVA;
        BackgroundCount++;
        if (BackgroundCount >= nmax)
            BackgroundCount = 0;
        BackgroundX[BackgroundCount] = 149 * 29 * 100 - 1100;
        BackgroundY[BackgroundCount] = 10 * 29 * 100 - 600;
        BackgroundType[BackgroundCount] = EDecorationType::TEXT_51;
        BackgroundCount++;
        if (BackgroundCount >= nmax)
            BackgroundCount = 0;

        BlockCount = 0;
        // ON-OFFブロック
        BlockSubType[BlockCount] = EBlockSubType::ON_BLOCK_LOCKED;
        BlockCreate(29 * 29, 3 * 29 - 12, EBlockType::ON_BLOCK);
        // 1-2
        BlockCreate(34 * 29, 9 * 29 - 12, EBlockType::GROUND_TOP);
        BlockCreate(35 * 29, 9 * 29 - 12, EBlockType::GROUND_TOP);
        // 隠し
        BlockCreate(55 * 29 + 15, 6 * 29 - 12, EBlockType::ITEM_BLOCK_HIDDEN);
        // BlockCreate(62*29,9*29-12,2);
        // 隠しON-OFF
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_TRAP_HIDDEN_FIREBAR_SWITCH;
        BlockCreate(50 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_TRAP_HIDDEN);
        // ヒント3
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_1_4_0;
        BlockCreate(1 * 29, 5 * 29 - 12, EBlockType::MESSAGE_BLOCK);
        // ファイア
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_ENEMY_BURNING_FLOWER;
        BlockCreate(86 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_ENEMY);
        // キノコなし　普通
        // txtype[tco]=2;BlockCreate(81*29,1*29-12,5);
        // 音符
        BlockSubType[BlockCount] = EBlockSubType::NOTE_BLOCK_WHITE_HIDDEN;
        BlockCreate(86 * 29, 6 * 29 - 12, EBlockType::NOTE_BLOCK);

        // もろいぶろっく×３ (Fragile Block x 3)
        for (t = 0; t <= 2; t++)
        {
            BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK_3;
            BlockCreate((79 + t) * 29, 13 * 29 - 12, EBlockType::BRICK_BRITTLE);
        }

        // ジャンプ (Jump)
        BlockSubType[BlockCount] = EBlockSubType::TRAMPOLINE_VISIBLE_3;
        BlockCreate(105 * 29, 11 * 29 - 12, EBlockType::TRAMPOLINE);
        // 毒1
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_MUSHROOM_POISONOUS_FASTER;
        BlockCreate(109 * 29, 7 * 29 - 12, EBlockType::ITEM_BLOCK_MUSHROOM);
        // デフラグ (Defrag)
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_ENEMY_DEFRAG_NORMAL;
        BlockCreate(111 * 29, 7 * 29 - 12, EBlockType::ITEM_BLOCK_ENEMY);
        // 剣 (Sword)
        BlockCreate(132 * 29, 8 * 29 - 12 - 3, EBlockType::SWORD);
        BlockCreate(131 * 29, 9 * 29 - 12, EBlockType::BRIDGE_ROPE);
        // メロン (Melon)
        //+KZ: wait what, google translates it as "melon" but everyone thinks it is a artichoke? xDDDD
        //  It does not even look like a artichoke... I can't trust people anymore
        BlockCreate(161 * 29, 12 * 29 - 12, EBlockType::MELON);
        // ファイアバー強化 (Fire Bar Enhancement)
        BlockCreate(66 * 29, 4 * 29 - 12, EBlockType::FIREBAR_GROW);

        // リフト (Lift)
        LiftCount = 0;
        t = LiftCount;
        LiftX[t] = 93 * 29 * 100;
        LiftY[t] = (10 * 29 - 12) * 100;
        LiftSizeX[t] = 60 * 100;
        srtype[t] = 0;
        sracttype[t] = 1;
        LiftVelY[t] = 0;
        LiftCount++;
        t = 20;
        LiftX[t] = 119 * 29 * 100 + 300;
        LiftY[t] = (10 * 29 - 12) * 100;
        LiftSizeX[t] = 12 * 30 * 100 + 1000;
        srtype[t] = 0;
        sracttype[t] = 0;
        LiftType[t] = ELiftType::GRAY;
        LiftVelY[t] = 0;
        LiftCount++;

        SyobonSection = 0;

        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }

    } // sta4
}

void HandleSyobonActionTwoLevels()
{
    if (SyobonWorld == 2 && SyobonLevel == 1 && SyobonSection == 0)
    { // 2-1
        PlayerX = 5600;
        PlayerY = 32000;
        bgmchange(Music[1]);
        StageColor = ELevelType::OVERWORLD;
        scrollx = 2900 * (113 - 19);
        //
        byte stagedatex[17][1001] = {
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             82, 0,
             0, 0, 0,
             0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 4, 4, 0, 0, 4, 0, 0, 4, 0, 0, 0, 0, 4, 0,
             0, 82,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 99, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4,
             4, 0,
             82, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 4, 0, 0,
             0, 0, 4,
             4, 4,
             4, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 4,
             4, 0,
             0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 4, 4, 4, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4,
             4, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             4, 0,
             0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 4, 0, 0, 0, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 7,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 4, 4, 4, 4,
             4, 0, 0,
             4, 7,
             7, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 2, 2, 98, 2, 4, 0,
             0, 0,
             0, 0, 0,
             0, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 4, 4, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 0, 0, 10, 10,
             10, 10,
             4, 1,
             1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 4, 0,
             0, 0,
             0, 0, 0, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 7, 0, 4, 4,
             4, 4, 4,
             4, 4,
             4},
            {0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 98,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 4,
             4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 4, 7, 7, 7, 4, 4, 4, 0, 0, 0, 0,
             80, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 80, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 80, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             4, 4,
             4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 7,
             0, 0, 4,
             4, 4,
             4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 81, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 81, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             81, 0, 0, 0, 81, 0, 0, 0, 0, 0, 0, 0, 0, 50, 0, 0, 50,
             0, 0,
             50, 81,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 81, 0, 0, 0, 0, 0, 0,
             4, 0,
             0, 4, 4,
             4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0,
             0, 0, 0,
             0, 0},

            {5, 5, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 0,
             0, 0, 0,
             0, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0, 0, 0, 0,
             5, 5, 5},
            {6, 6, 0, 0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 0, 0, 0, 0, 6, 6, 6, 6, 6, 6, 0,
             0, 0, 0,
             0, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 0, 0, 0,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 0, 0, 0, 0, 0, 0, 6, 6, 0, 0, 0, 0, 0,
             6, 6, 6},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0}};
        // 追加情報
        BlockCount = 0;
        //
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_2_1_0_1;
        BlockCreate(1 * 29, 9 * 29 - 12, EBlockType::MESSAGE_BLOCK);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(40 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_POISON_HIDDEN);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_2_1_0_2;
        BlockCreate(79 * 29, 7 * 29 - 12, EBlockType::MESSAGE_BLOCK);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_MUSHROOM_GROW;
        BlockCreate(83 * 29, 7 * 29 - 12, EBlockType::ITEM_BLOCK_MUSHROOM);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_TRAP_HIDDEN_NORMAL;
        BlockCreate(83 * 29, 2 * 29 - 12, EBlockType::ITEM_BLOCK_TRAP_HIDDEN);
        BlockCount += 1;
        //
        for (int i = -1; i > -7; i -= 1)
        {
            BlockCreate(85 * 29, i * 29 - 12, EBlockType::HARD_BLOCK);
            BlockCount += 1;
        }
        //
        GroundCount = 0;
        GroundX[GroundCount] = 30 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 12000 - 1;
        GroundSizeY[GroundCount] = 3000;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 51 * 29 * 100;
        GroundY[GroundCount] = (4 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 9000 - 1;
        GroundSizeY[GroundCount] = 3000;
        GroundType[GroundCount] = EObjectType::FALLING_BLOCKS;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 84 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 9000 - 1;
        GroundSizeY[GroundCount] = 3000;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 105 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 15000 - 1;
        GroundSizeY[GroundCount] = 3000;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        EnemyAppearCount = 0;
        //
        EnemyAppearX[EnemyAppearCount] = 6 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (3 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::EVIL_CLOUD_NORMAL;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 13 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::BALL_SPIKY;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 23 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::EVIL_CLOUD_NORMAL;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 25 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::EVIL_CLOUD_HIDDEN;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 27 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::EVIL_CLOUD_NORMAL;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 88 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (12 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
    }

    if (SyobonWorld == 2 && SyobonLevel == 2 && SyobonSection == 0)
    { // 2-2(地上)
        bgmchange(Music[1]);
        StageColor = ELevelType::OVERWORLD;
        scrollx = 2900 * (19 - 19);
        //
        byte stagedatex[17][1001] = {
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 82, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 7, 0, 0, 0},
            {0, 80, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5},
            {6, 6, 6, 6, 6, 6, 6, 0, 0, 0, 0, 0, 0, 0, 6, 6, 6},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};
        //
        GroundX[GroundCount] = 14 * 29 * 100 + 200;
        GroundY[GroundCount] = -6000;
        GroundSizeX[GroundCount] = 5000;
        GroundSizeY[GroundCount] = 70000;
        GroundType[GroundCount] = EObjectType::TRIGGER_SEAL_UP;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 12 * 29 * 100 + 1200;
        GroundY[GroundCount] = -6000;
        GroundSizeX[GroundCount] = 7000;
        GroundSizeY[GroundCount] = 70000;
        GroundType[GroundCount] = EObjectType::TRIGGER_SEAL_DOWN;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 12 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 6000 - 1;
        GroundSizeY[GroundCount] = 3000;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundAI[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 14 * 29 * 100;
        GroundY[GroundCount] = (9 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 6000;
        GroundSizeY[GroundCount] = 12000 - 200;
        GroundType[GroundCount] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[GroundCount] = 1;
        GroundCount += 1;
        //
        BlockCreate(6 * 29, 9 * 29 - 12, EBlockType::ITEM_BLOCK_POISON_HIDDEN);
        //
        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
    }

    if (SyobonWorld == 2 && SyobonLevel == 2 && SyobonSection == 1)
    { // 2-2(地下)
        bgmchange(Music[2]);
        StageColor = ELevelType::UNDERGROUND;
        PlayerX = 7500;
        PlayerY = 9000;
        scrollx = 2900 * (137 - 19);
        //
        byte stagedatex[17][1001] = {
            {0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
             4, 4, 4,
             4, 4,
             4, 4, 4, 4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4,
             4, 4, 4,
             4, 98,
             4, 4, 4, 4, 4, 4, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4,
             4, 98, 1},
            {4, 0, 0, 0, 0, 0, 0, 10, 10, 10, 10, 10, 10, 10, 10,
             10, 10,
             10, 10,
             10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 0, 0,
             0, 0, 0,
             0, 0,
             0, 7, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             10, 10,
             10, 10,
             10, 10, 10, 10, 10, 10, 10, 0, 0, 1, 1, 1, 1, 1, 1, 0,
             0, 0,
             10, 10,
             10, 10, 10, 10, 10, 10, 10, 0, 0, 1},
            {4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 1},
            {4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0,
             0, 0, 0,
             0, 7,
             0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 1},
            {4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 51, 0,
             0, 0,
             0, 0, 0,
             7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 1},
            {4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 10, 10, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4,
             4, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 1, 1, 1, 1, 1, 1, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             1},
            {4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0,
             0, 3, 0,
             0, 0,
             3, 0, 0, 0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 1},
            {4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 57,
             0, 0, 0,
             0, 0, 57, 0, 0, 0, 0, 0, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4,
             4, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 7,
             0, 0, 0, 0, 0, 0, 0, 0, 10, 4, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             44, 0,
             0, 1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             1},
            {4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 7, 7, 7,
             0, 97,
             0, 0, 0,
             1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 1},
            {4, 7, 7, 7, 7, 7, 7, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 0, 0, 1, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 1, 4, 4, 0, 0, 0, 1, 1, 0, 0, 0, 0, 44,
             0, 0, 1},
            {4, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 1, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 1, 1, 0, 0, 0, 97, 0,
             0, 0, 1},
            {4, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 1, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1,
             1, 1, 1},
            {4, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 1, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 1, 4, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1,
             1, 1, 1},
            {5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 5, 0, 0, 1, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 1, 5, 5, 5, 0, 0, 1, 1, 0, 0, 0, 1, 1,
             1, 1, 1},
            {6, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 6, 6, 6, 6, 0, 0, 1, 0, 0, 0,
             1, 1, 1,
             1, 1,
             1, 1, 1, 1, 1, 1, 6, 6, 6, 0, 0, 1, 1, 0, 0, 0, 1, 1,
             1, 1, 1},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0}};
        //
        EnemyAppearCount = 0;
        EnemyAppearX[EnemyAppearCount] = 32 * 29 * 100 - 1400;
        EnemyAppearY[EnemyAppearCount] = (-2 * 29 - 12) * 100 + 500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FALLING_CAT;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::NONE;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = (31 * 29 - 12) * 100;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::BALL_ROCKET;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::BALL_ROCKET_0;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 38 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)107;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 38 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_COUNTERCLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)107;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 42 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)107;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 42 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_COUNTERCLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)107;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 46 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)107;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 46 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_COUNTERCLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)107;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 58 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 66 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 76 * 29 * 100 - 1400;
        EnemyAppearY[EnemyAppearCount] = (-2 * 29 - 12) * 100 + 500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FALLING_CAT;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::NONE;
        EnemyAppearCount += 1;
        //
        GroundCount = 0;
        GroundX[GroundCount] = 2 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 300000 - 6001;
        GroundSizeY[GroundCount] = 3000;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 3 * 29 * 100;
        GroundY[GroundCount] = (7 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 3000;
        GroundSizeY[GroundCount] = 3000;
        GroundType[GroundCount] = EObjectType::TRIGGER_PLATFORM_SPLIT;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 107 * 29 * 100;
        GroundY[GroundCount] = (9 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 9000 - 1;
        GroundSizeY[GroundCount] = 24000;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 1;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 111 * 29 * 100;
        GroundY[GroundCount] = (7 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 3000;
        GroundSizeY[GroundCount] = 6000 - 200;
        GroundType[GroundCount] = EObjectType::ENTRANCE_HORIZONTAL_PIPE_HEAD;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 113 * 29 * 100 + 1100;
        GroundY[GroundCount] = (0 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 4700;
        GroundSizeY[GroundCount] = 27000 - 1000;
        GroundType[GroundCount] = EObjectType::VERTICAL_PIPE_BODY;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 128 * 29 * 100;
        GroundY[GroundCount] = (9 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 9000 - 1;
        GroundSizeY[GroundCount] = 24000;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 1;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 131 * 29 * 100;
        GroundY[GroundCount] = (9 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 3000;
        GroundSizeY[GroundCount] = 6000 - 200;
        GroundType[GroundCount] = EObjectType::ENTRANCE_HORIZONTAL_PIPE_HEAD;
        GroundSubType[GroundCount] = 2;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 133 * 29 * 100 + 1100;
        GroundY[GroundCount] = (0 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 4700;
        GroundSizeY[GroundCount] = 32000;
        GroundType[GroundCount] = EObjectType::VERTICAL_PIPE_BODY;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        BlockCount = 0;
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(0 * 29, 0 * 29 - 12, EBlockType::HARD_BLOCK);
        BlockCount = 1;
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(2 * 29, 9 * 29 - 12, EBlockType::HARD_BLOCK);
        BlockCount = 2;
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(3 * 29, 9 * 29 - 12, EBlockType::HARD_BLOCK);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(5 * 29, 9 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(6 * 29, 9 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(5 * 29, 10 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(6 * 29, 10 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(5 * 29, 11 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(6 * 29, 11 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(5 * 29, 12 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(6 * 29, 12 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(70 * 29, 7 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(71 * 29, 7 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
    }

    if (SyobonWorld == 2 && SyobonLevel == 2 && SyobonSection == 2)
    { // 2-2 地上
        //
        bgmchange(Music[1]);
        StageColor = ELevelType::OVERWORLD;
        scrollx = 2900 * (36 - 19);
        PlayerX = 7500;
        PlayerY = 3000 * 9;
        //
        byte stagedatex[17][1001] = {
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 82, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 99, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50,
             51, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4,
             4, 4, 4,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4,
             4, 4, 4,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4,
             4, 4, 4,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 4, 4, 4, 4, 4,
             4, 4,
             4, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4,
             4, 4, 4,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4,
             4, 4, 4,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 40, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4,
             4, 4,
             4, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 41, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4,
             4, 4,
             4, 0, 0,
             0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 54, 0, 0},
            {5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             0, 0,
             0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5},
            {6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             0, 0,
             0, 0, 0, 0, 6, 6, 6, 6, 6, 6, 6, 6, 6},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};
        //
        EnemyAppearCount = 0;
        EnemyAppearX[EnemyAppearCount] = 9 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (12 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 10 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (11 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 11 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (10 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 12 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (9 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 13 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (8 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 14 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 15 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 16 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (5 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 17 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (5 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 18 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (5 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 19 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (5 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 20 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (5 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
    }
    //
    if (SyobonWorld == 2 && SyobonLevel == 3 && SyobonSection == 0)
    { // 2-3
        PlayerX = 7500;
        PlayerY = 3000 * 8;
        bgmchange(Music[1]);
        StageColor = ELevelType::OVERWORLD;
        scrollx = 2900 * (126 - 19);
        //
        byte stagedatex[17][1001] = {
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             4, 4,
             4, 4, 4, 4, 4, 4, 4, 4, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
             4, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             82, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 7, 0, 0,
             0, 0, 0,
             4, 4,
             4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 82, 0, 0,
             0, 0,
             0, 0,
             56, 0, 0, 0, 0, 0, 0, 0, 0, 4, 10, 10, 10, 10, 10, 10,
             10, 10,
             10,
             10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 99, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 51, 0, 1, 0,
             0, 0,
             0, 4, 4,
             4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 1, 0,
             0, 0,
             1, 0, 0, 0, 0, 0, 82, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 82, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             50, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 1, 0, 0, 0, 1,
             7, 0, 0,
             0, 4,
             4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             4, 4,
             4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 4, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             4, 4,
             4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 10, 4, 4, 4, 0, 54, 0,
             54, 0, 4,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 58, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 4, 4,
             4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 4, 0, 0, 4, 4, 4, 4,
             4, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             7, 4,
             7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 4, 0, 0, 0, 0, 0, 0,
             0, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 58, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 4, 0, 0, 0, 0, 0, 0,
             0, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 7, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 0, 4, 0, 0, 0, 0, 0, 0,
             0, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 7, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 52, 0, 0, 0, 0, 4, 1, 1, 1, 4,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 10, 10, 0, 4, 0, 0, 0, 0, 0, 0,
             0, 4,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 7,
             0, 0, 0, 4, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 30, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0,
             0, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 3,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0,
             0, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 4, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 5,
             5, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0,
             0, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 5, 5, 0, 5, 5, 5, 5, 5},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 6, 6, 6, 6, 6,
             6, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0,
             0, 4, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 6, 6, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 6, 6, 0, 6, 6, 6, 6, 6},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0}};
        //
        BlockCount = 0;
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        for (int i = -1; i > -7; i -= 1)
        {
            BlockCreate(55 * 29, i * 29 - 12, EBlockType::HARD_BLOCK);
            BlockCount += 1;
        }
        //
        BlockSubType[BlockCount] = EBlockSubType::TRAMPOLINE_VISIBLE;
        BlockCreate(64 * 29, 12 * 29 - 12, EBlockType::TRAMPOLINE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(66 * 29, 3 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(67 * 29, 3 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(68 * 29, 3 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_2_3_0;
        BlockCreate(60 * 29, 6 * 29 - 12, EBlockType::MESSAGE_BLOCK);
        BlockCount += 1;
        /*
           bco = 1;
           ba[bco]=(54*29-12)*100;
           bb[bco]=(1*29-12)*100;
           btype[bco]=80;
           bxtype[bco]=0;
           bco += 1;
         */
        GroundCount = 0;
        EnemyAppearX[GroundCount] = (102 * 29 - 12) * 100;
        EnemyAppearY[GroundCount] = (10 * 29 - 12) * 100;
        EnemyAppearType[GroundCount] = EEnemyType::UNKNOWN_ID_50;
        EnemyAppearSubType[GroundCount] = EEnemySubType::UNKNOWN_ID_50_1;
        GroundCount += 1;
        //
        LiftCount = 0;
        LiftX[LiftCount] = 1 * 29 * 100;
        LiftY[LiftCount] = (10 * 29 - 12) * 100;
        LiftSizeX[LiftCount] = 5 * 3000;
        srtype[LiftCount] = 0;
        sracttype[LiftCount] = 1;
        LiftVelY[LiftCount] = 0;
        LiftType[LiftCount] = ELiftType::PILLAR;
        LiftCount++;
        //
        LiftX[LiftCount] = 18 * 29 * 100;
        LiftY[LiftCount] = (4 * 29 - 12) * 100;
        LiftSizeX[LiftCount] = 3 * 3000;
        srtype[LiftCount] = 0;
        sracttype[LiftCount] = 0;
        LiftVelY[LiftCount] = 0;
        LiftType[LiftCount] = ELiftType::PILLAR;
        LiftCount++;
        //
        LiftX[LiftCount] = 35 * 29 * 100;
        LiftY[LiftCount] = (4 * 29 - 12) * 100;
        LiftSizeX[LiftCount] = 5 * 3000;
        srtype[LiftCount] = 0;
        sracttype[LiftCount] = 0;
        LiftVelY[LiftCount] = 0;
        LiftType[LiftCount] = ELiftType::PILLAR;
        LiftCount++;
        //
        LiftX[LiftCount] = 35 * 29 * 100;
        LiftY[LiftCount] = (8 * 29 - 12) * 100;
        LiftSizeX[LiftCount] = 5 * 3000;
        srtype[LiftCount] = 0;
        sracttype[LiftCount] = 0;
        LiftVelY[LiftCount] = 0;
        LiftType[LiftCount] = ELiftType::PILLAR;
        LiftCount++;
        //
        LiftX[LiftCount] = 94 * 29 * 100;
        LiftY[LiftCount] = (6 * 29 - 12) * 100;
        LiftSizeX[LiftCount] = 3 * 3000;
        srtype[LiftCount] = 0;
        sracttype[LiftCount] = 0;
        LiftVelY[LiftCount] = 0;
        LiftType[LiftCount] = ELiftType::BREAKING;
        LiftCount++;
        //
        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
    }
    //
    if (SyobonWorld == 2 && SyobonLevel == 4 && (SyobonSection == 0 || SyobonSection == 10 || SyobonSection == 12))
    { // 2-4(1番)
        if (SyobonSection == 0)
        {
            PlayerX = 7500;
            PlayerY = 3000 * 4;
        }
        else
        {
            PlayerX = 19500;
            PlayerY = 3000 * 11;
            SyobonSection = 0;
        }
        bgmchange(Music[4]);
        StageColor = ELevelType::CASTLE;
        scrollx = 2900 * (40 - 19);
        //
        byte stagedatex[17][1001] = {
            {5, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
            {5, 5, 5, 5, 5, 5, 5, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 10,
             0, 0,
             0, 10,
             10, 10, 0, 0, 0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5},
            {5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 7, 7, 10, 10, 10, 5, 5, 5, 5, 5},
            {5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5},
            {5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5},
            {5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 5, 5, 5, 5, 7,
             7, 7, 3,
             7, 0,
             7, 5, 0, 0, 5, 5, 5, 0, 58, 0, 5, 0, 0, 5, 5},
            {5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 5, 5, 5, 5, 0,
             0, 0, 0,
             0, 0,
             0, 5, 0, 0, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5},
            {5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0,
             0, 0, 0,
             0, 0,
             0, 5, 0, 0, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5},
            {5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0,
             0, 0, 0,
             0, 0,
             0, 5, 0, 0, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5},
            {5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 5, 5, 5, 5, 0,
             0, 0, 0,
             0, 0,
             0, 5, 0, 0, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5},
            {5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 5, 5, 5, 5, 0,
             0, 0, 0,
             0, 0,
             0, 5, 0, 0, 5, 5, 5, 0, 0, 0, 5, 5, 5, 5, 5},
            {5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 59, 59, 0, 5, 5, 5, 5, 0,
             0, 0,
             0, 0,
             0, 0, 5, 0, 0, 0, 0, 5, 59, 0, 0, 5, 5, 5, 5, 5},
            {5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 5, 0,
             0, 0, 0,
             0, 0,
             0, 5, 0, 0, 0, 0, 5, 0, 0, 0, 5, 5, 5, 5, 5},
            {5, 5, 5, 5, 5, 5, 40, 0, 5, 0, 0, 0, 0, 5, 5, 5, 5, 0,
             0, 0,
             0, 0, 0,
             0, 5, 0, 0, 0, 0, 5, 0, 59, 0, 5, 5, 5, 5, 5},
            {5, 86, 5, 5, 5, 5, 41, 0, 5, 86, 0, 0, 86, 5, 5, 5, 5,
             86, 0,
             0, 86,
             0, 0, 86, 5, 0, 86, 5, 5, 5, 86, 0, 0, 5, 5, 5, 5, 5},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 59, 59, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 59, 0, 0, 0, 0, 0}};
        //
        BlockCount = 0;
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(0 * 29, -1 * 29 - 12, EBlockType::GROUND_TOP);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(4 * 29, -1 * 29 - 12, EBlockType::GROUND_TOP);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(1 * 29, 14 * 29 - 12, EBlockType::GROUND_TOP);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(6 * 29, 14 * 29 - 12, EBlockType::GROUND_TOP);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(7 * 29, 14 * 29 - 12, EBlockType::GROUND_TOP);
        BlockCount += 1;
        //
        EnemyAppearCount = 0;
        EnemyAppearX[EnemyAppearCount] = 2 * 29 * 100 - 1400;
        EnemyAppearY[EnemyAppearCount] = (-2 * 29 - 12) * 100 + 500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FALLING_CAT;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::NONE;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 20 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (5 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)107;
        EnemyAppearCount += 1;
        //
        GroundCount = 0;
        GroundX[GroundCount] = 17 * 29 * 100;
        GroundY[GroundCount] = (9 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 21000 - 1;
        GroundSizeY[GroundCount] = 3000 - 1;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 2;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 27 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 6000;
        GroundSizeY[GroundCount] = 6000;
        GroundType[GroundCount] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[GroundCount] = 6;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 34 * 29 * 100;
        GroundY[GroundCount] = (5 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 6000;
        GroundSizeY[GroundCount] = 30000;
        GroundType[GroundCount] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[GroundCount] = 1;
        GroundCount += 1;
        //
        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
    }

    if (SyobonWorld == 2 && SyobonLevel == 4 && SyobonSection == 1)
    { // 2-4(2番)
        PlayerX = 4500;
        PlayerY = 3000 * 11;
        bgmchange(Music[4]);
        StageColor = ELevelType::CASTLE;
        scrollx = 2900 * (21 - 19);
        //
        byte stagedatex[17][1001] = {
            {5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             98},
            {0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 7, 7, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0},
            {0, 5, 5, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0},
            {0, 10, 10, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0,
             0},
            {0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 44, 0,
             0},
            {0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 97, 0, 0,
             0},
            {0, 40, 0, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 5, 5, 5,
             5},
            {86, 41, 0, 86, 0, 5, 86, 0, 0, 86, 0, 5, 86, 0, 0, 86,
             0, 0,
             86},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};
        //
        BlockCount = 0;
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(12 * 29, 13 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(13 * 29, 13 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(14 * 29, 13 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        GroundCount = 0;
        GroundX[GroundCount] = 6 * 29 * 100;
        GroundY[GroundCount] = (6 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 18000 - 1;
        GroundSizeY[GroundCount] = 6000 - 1;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 12 * 29 * 100;
        GroundY[GroundCount] = (8 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 9000 - 1;
        GroundSizeY[GroundCount] = 3000 - 1;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 2;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 15 * 29 * 100;
        GroundY[GroundCount] = (11 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 3000;
        GroundSizeY[GroundCount] = 6000;
        GroundType[GroundCount] = EObjectType::ENTRANCE_HORIZONTAL_PIPE_HEAD;
        GroundSubType[GroundCount] = 2;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 17 * 29 * 100 + 1100;
        GroundY[GroundCount] = (0 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 4700;
        GroundSizeY[GroundCount] = 38000;
        GroundType[GroundCount] = EObjectType::VERTICAL_PIPE_BODY;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
    }

    if (SyobonWorld == 2 && SyobonLevel == 4 && SyobonSection == 2)
    { // 2-4(3番)
        PlayerX = 4500;
        PlayerY = 3000 * 11;
        bgmchange(Music[4]); // 6
        StageColor = ELevelType::CASTLE;
        scrollx = 2900 * (128 - 19);
        //
        byte stagedatex[17][1001] = {
            {5, 5, 5, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
            {5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 5, 0,
             0, 0,
             0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 5, 5,
             5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 5, 0,
             0, 0,
             0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 5, 5,
             5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 5, 0,
             0, 0,
             0, 5, 0, 5, 5, 5, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 5, 5,
             5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 7,
             7, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0,
             0, 5, 0,
             0, 5,
             0, 5, 0, 10, 10, 5, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0,
             0, 60, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 5,
             5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             0, 5, 0,
             0, 5,
             0, 5, 0, 0, 0, 5, 0, 5, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             5, 5,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             0, 5, 3,
             0, 5,
             0, 3, 0, 0, 0, 5, 0, 5, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             5, 5,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 0, 0, 0, 0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             0, 5, 0,
             0, 5,
             0, 5, 5, 5, 0, 5, 0, 5, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 7, 7, 7, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             5, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {3, 0, 0, 3, 0, 0, 3, 7, 0, 3, 7, 7, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 5, 0,
             5, 0, 0,
             0, 5,
             0, 5, 10, 10, 0, 5, 0, 5, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             5, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 7, 7, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 5,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 0, 0, 0,
             0, 0, 0,
             0, 5,
             0, 5, 0, 0, 0, 5, 0, 5, 7, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             5, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 3, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             0, 0, 0,
             0, 5,
             0, 0, 0, 30, 0, 5, 0, 0, 0, 0, 0, 0, 7, 7, 5, 0, 0, 0,
             5, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 5, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
            {5, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 5, 5,
             5, 5, 0,
             0, 5,
             0, 0, 7, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 0,
             5, 0, 0,
             0, 5,
             5, 5, 5, 5, 0, 0, 0, 5, 5, 5, 0, 0, 0, 5, 5, 5, 0, 0,
             0, 5, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
            {5, 0, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             0, 0, 0,
             0, 5,
             0, 0, 0, 5, 0, 5, 0, 0, 0, 0, 0, 5, 0, 0, 5, 0, 0, 0,
             5, 59,
             0, 59,
             5, 5, 5, 5, 5, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
            {5, 40, 0, 5, 0, 0, 5, 0, 0, 5, 0, 0, 5, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 0, 0, 0,
             0, 0, 0,
             0, 5,
             0, 0, 0, 5, 0, 5, 0, 5, 0, 0, 0, 5, 0, 0, 5, 0, 0, 0,
             5, 0,
             59, 0, 5,
             5, 5, 5, 5, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5},
            {5, 41, 0, 5, 86, 0, 5, 86, 0, 5, 5, 5, 5, 86, 0, 0, 86,
             0, 0,
             86, 0,
             0, 86, 0, 0, 86, 0, 0, 86, 0, 0, 86, 0, 0, 86, 0, 0, 5,
             86, 0,
             0, 86,
             0, 0, 86, 5, 0, 86, 0, 5, 86, 5, 0, 5, 86, 0, 0, 5, 5,
             5, 5,
             86, 0,
             0, 5, 86, 59, 0, 5, 5, 5, 5, 5, 86, 0, 0, 86, 5, 5, 86,
             0, 0,
             86, 0,
             0, 86, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 86, 0, 0, 86,
             0, 0,
             86, 0, 0,
             86, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
             5, 5,
             5, 5, 5},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             59, 0,
             0, 0, 0, 0, 59, 0, 59, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 59,
             0, 59,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};
        //
        BlockCount = 0;
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(1 * 29, 14 * 29 - 12, EBlockType::GROUND_TOP);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(2 * 29, 14 * 29 - 12, EBlockType::GROUND_TOP);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_2_4_2;
        BlockCreate(3 * 29, 4 * 29 - 12, EBlockType::MESSAGE_BLOCK);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(32 * 29, 9 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(76 * 29, 14 * 29 - 12, EBlockType::GROUND_TOP);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(108 * 29, 11 * 29 - 12, EBlockType::BRIDGE_ROPE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(109 * 29, 10 * 29 - 12 - 3, EBlockType::SWORD);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::NONE;
        BlockCreate(121 * 29, 10 * 29 - 12, EBlockType::MELON);
        BlockCount += 1;
        //
        EnemyAppearCount = 0;
        EnemyAppearX[EnemyAppearCount] = 0 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (8 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_COUNTERCLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)105;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 2 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (0 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::EVIL_CLOUD_HIDDEN;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 3 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (8 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)105;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 6 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (8 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_COUNTERCLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)107;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 9 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (8 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_COUNTERCLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)107;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 25 * 29 * 100 - 1400;
        EnemyAppearY[EnemyAppearCount] = (2 * 29 - 12) * 100 - 400;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FALLING_CAT;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::NONE;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 40 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (8 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_GROUND_TOP;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 42 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (8 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_GROUND_TOP;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 43 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_COUNTERCLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)105;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 47 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)105;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 57 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_GROUND_TOP;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 77 * 29 * 100 - 1400;
        EnemyAppearY[EnemyAppearCount] = (2 * 29 - 12) * 100 - 400;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FALLING_CAT;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::NONE;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 83 * 29 * 100 - 1400;
        EnemyAppearY[EnemyAppearCount] = (2 * 29 - 12) * 100 - 400;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FALLING_CAT;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::NONE;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 88 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (9 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)105;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 88 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (9 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_COUNTERCLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)105;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 90 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (9 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_GROUND_TOP;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 107 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (10 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::MOLALLA;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::MOLALLA_ALIVE;
        EnemyAppearCount += 1;
        //
        GroundCount = 0;
        GroundX[GroundCount] = 13 * 29 * 100;
        GroundY[GroundCount] = (8 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 33000 - 1;
        GroundSizeY[GroundCount] = 3000 - 1;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 2;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 13 * 29 * 100;
        GroundY[GroundCount] = (0 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 33000 - 1;
        GroundSizeY[GroundCount] = 3000 - 1;
        GroundType[GroundCount] = EObjectType::FALLING_BLOCKS;
        GroundSubType[GroundCount] = 3;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 10 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 6000;
        GroundSizeY[GroundCount] = 6000;
        GroundType[GroundCount] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[GroundCount] = 6;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 46 * 29 * 100;
        GroundY[GroundCount] = (12 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 9000 - 1;
        GroundSizeY[GroundCount] = 3000 - 1;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 2;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 58 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 6000;
        GroundSizeY[GroundCount] = 6000;
        GroundType[GroundCount] = EObjectType::ENTRANCE_VERTICAL_PIPE_HEAD;
        GroundSubType[GroundCount] = 6;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 101 * 29 * 100 - 1500;
        GroundY[GroundCount] = (10 * 29 - 12) * 100 - 3000;
        GroundSizeX[GroundCount] = 12000;
        GroundSizeY[GroundCount] = 12000;
        GroundType[GroundCount] = EObjectType::TRIGGER_MULTI_LASER;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 102 * 29 * 100 + 3000;
        GroundY[GroundCount] = (2 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 3000 - 1;
        GroundSizeY[GroundCount] = 300000;
        GroundType[GroundCount] = EObjectType::TRIGGER_GENERIC_1;
        GroundSubType[GroundCount] = 20;
        GroundCount += 1;
        //
        LiftCount = 0;
        LiftX[LiftCount] = 74 * 29 * 100 - 1500;
        LiftY[LiftCount] = (7 * 29 - 12) * 100;
        LiftSizeX[LiftCount] = 2 * 3000;
        srtype[LiftCount] = 0;
        sracttype[LiftCount] = 1;
        LiftVelY[LiftCount] = 0;
        LiftType[LiftCount] = ELiftType::YELLOW;
        LiftCount = 20;
        //
        LiftX[LiftCount] = 97 * 29 * 100;
        LiftY[LiftCount] = (12 * 29 - 12) * 100;
        LiftSizeX[LiftCount] = 12 * 3000;
        srtype[LiftCount] = 0;
        sracttype[LiftCount] = 0;
        LiftVelY[LiftCount] = 0;
        LiftType[LiftCount] = ELiftType::GRAY;
        LiftCount += 1;
        //
        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
    }

    if (SyobonWorld == 3 && SyobonLevel == 1 && SyobonSection == 0)
    { // 3-1
        PlayerX = 5600;
        PlayerY = 32000;
        bgmchange(Music[6]);
        StageColor = ELevelType::ICY;
        scrollx = 2900 * (112 - 19);
        byte stagedatex[17][1001] = {
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 7,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             82, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 4, 7,
             7, 7, 7,
             7, 7,
             7, 7, 7, 7, 7, 7, 7, 7, 99, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0},
            {0, 0, 0, 0, 0, 0, 82, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 7, 0, 4, 4, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 7, 7, 7, 7, 4, 0,
             0, 82,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 10, 10, 0, 0, 10, 10,
             4, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 0, 4, 0, 0, 0, 0, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0},
            {0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 7, 0, 0, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 4, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 4, 0, 0, 0, 0, 4, 0,
             0, 0, 0,
             0, 0,
             0, 0, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 3, 4, 4, 4, 4, 4, 0,
             0, 0, 0,
             0, 0,
             0, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 7, 4, 4, 4, 4, 0, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 4, 4, 4, 4, 4, 4, 0,
             0, 0, 0,
             0, 0,
             4, 4, 4, 4, 0, 0, 0, 4, 0, 7, 7, 4, 4, 4, 4, 0, 4, 4,
             4, 4, 4,
             4, 4},
            {0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 7, 0, 0, 4, 0, 4, 4, 4, 4, 4, 4, 0,
             0, 0, 0,
             0, 4,
             4, 4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4,
             4, 4, 4,
             4, 4},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 4, 4, 4, 4, 4, 4, 0,
             0, 0, 0,
             4, 4,
             4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4,
             4, 4, 4,
             4, 4},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30,
             0, 0,
             0, 0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 4,
             4, 4,
             4, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4,
             4, 4, 4,
             4, 4},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             1, 0,
             51, 1, 0, 81, 0, 0, 1, 1, 1, 1, 1, 7, 0, 0, 0, 0, 0, 4,
             0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 7,
             0, 0, 4,
             4, 4,
             4, 4, 4, 4, 4, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0, 0, 0, 4,
             4, 4, 4,
             4, 4,
             4},
            {0, 0, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 5, 5,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
             0, 1, 0,
             0, 0,
             0, 0, 0, 0, 0, 5, 0, 0, 0, 5, 5, 5, 5, 5, 5, 0, 0, 7,
             5, 5, 5,
             5, 5,
             5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 5, 5, 5, 5, 5, 5, 5,
             5, 5, 5,
             5, 5},
            {0, 0, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 0, 0, 0, 0, 0, 6, 6,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 6, 0, 0, 0, 6, 6, 6, 6, 6, 6, 0, 0, 0,
             6, 6, 6,
             6, 6,
             6, 6, 6, 6, 6, 6, 6, 6, 6, 0, 0, 6, 6, 6, 6, 6, 6, 6,
             6, 6, 6,
             6, 6},
            {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0,
             0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
             0, 0, 0,
             0, 0}};
        // 追加情報
        BlockCount = 0;
        //
        BlockSubType[BlockCount] = EBlockSubType::MESSAGE_BLOCK_3_1_0;
        BlockCreate(2 * 29, 9 * 29 - 12, EBlockType::MESSAGE_BLOCK);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(63 * 29, 13 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        BlockSubType[BlockCount] = EBlockSubType::BRICK_BRITTLE_BRICK;
        BlockCreate(64 * 29, 13 * 29 - 12, EBlockType::BRICK_BRITTLE);
        BlockCount += 1;
        //
        GroundCount = 0;
        GroundX[GroundCount] = 13 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 9000 - 1;
        GroundSizeY[GroundCount] = 3000;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        GroundX[GroundCount] = 84 * 29 * 100;
        GroundY[GroundCount] = (13 * 29 - 12) * 100;
        GroundSizeX[GroundCount] = 9000 - 1;
        GroundSizeY[GroundCount] = 3000;
        GroundType[GroundCount] = EObjectType::FALLING_FLOOR;
        GroundSubType[GroundCount] = 0;
        GroundCount += 1;
        //
        EnemyAppearCount = 0;
        EnemyAppearX[EnemyAppearCount] = 108 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (6 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::DEFRAG;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::DEFRAG_GRAB_POLE;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 33 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (10 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 36 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (0 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::EVIL_CLOUD;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::EVIL_CLOUD_HIDDEN;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 78 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_COUNTERCLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)105;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 80 * 29 * 100 + 1500;
        EnemyAppearY[EnemyAppearCount] = (7 * 29 - 12) * 100 + 1500;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::FIREBAR_CLOCKWISE;
        EnemyAppearSubType[EnemyAppearCount] = (EEnemySubType)105;
        EnemyAppearCount += 1;
        //
        EnemyAppearX[EnemyAppearCount] = 85 * 29 * 100;
        EnemyAppearY[EnemyAppearCount] = (11 * 29 - 12) * 100;
        EnemyAppearType[EnemyAppearCount] = EEnemyType::SPIKY_BLOCK;
        EnemyAppearSubType[EnemyAppearCount] = EEnemySubType::SPIKY_BLOCK_HARD_BLOCK;
        EnemyAppearCount += 1;
        //
        LiftCount = 0;
        LiftX[LiftCount] = 41 * 29 * 100;
        LiftY[LiftCount] = (3 * 29 - 12) * 100;
        LiftSizeX[LiftCount] = 3 * 3000;
        srtype[LiftCount] = 0;
        sracttype[LiftCount] = 0;
        LiftVelY[LiftCount] = 0;
        LiftType[LiftCount] = ELiftType::PUSH_RIGHT;
        LiftCount = 0;
        //
        for (tt = 0; tt <= 1000; tt++)
        {
            for (t = 0; t <= 16; t++)
            {
                stagedate[t][tt] = 0;
                stagedate[t][tt] = stagedatex[t][tt];
            }
        }
    }
}

// Extremely incomplete
void HandleSyobonActionThreeLevels()
{
    if (SyobonWorld == 1 && SyobonLevel == 1 && SyobonSection == 0)
    {
        scrollx = 1000000;
        byte stagedatex21[17][1001];

        memset(stagedatex21[0], 0, sizeof(stagedatex21[0]));

        memset(stagedatex21[1], 0, sizeof(stagedatex21[1]));
        stagedatex21[1][64] = 82;

        {
            const byte Data[134] = {
                    0, 82, 0, 0, 0, 0, 0, 0, 0, 0,
                    84, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 82, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 98, 0, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 99, 0, 0, 0, 0, 0, 0,
                    0, 0, 0, 0
                };
            
            memset(stagedatex21[2], 0, sizeof(stagedatex21[2]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[2][i] = Data[i];
            }
        }

        memset(stagedatex21[3], 0, sizeof(stagedatex21[3]));
        stagedatex21[3][52] = 40;

        memset(stagedatex21[4], 0, sizeof(stagedatex21[4]));
        stagedatex21[4][16] = 40;

        {
            const byte Data[134] = {
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 4, 1, 1, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 98,
				98, 98, 1, 1, 0, 0, 0, 1, 1, 1,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 2, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 98, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 4, 4, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0
			};
            
            memset(stagedatex21[5], 0, sizeof(stagedatex21[5]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[5][i] = Data[i];
            }
        }

        {
            const byte Data[134] = {
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 7,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 4, 4, 4, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0
			};
            
            memset(stagedatex21[6], 0, sizeof(stagedatex21[6]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[6][i] = Data[i];
            }
        }

        {
            const byte Data[134] = {
				0, 0, 0, 0, 0, 0, 7, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 50, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 30, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 4, 4, 4, 4, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0
			};
            
            memset(stagedatex21[7], 0, sizeof(stagedatex21[7]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[7][i] = Data[i];
            }
        }

        {
            const byte Data[134] = {
				0, 0, 0, 7, 7, 7, 0, 0, 0, 0,
				0, 0, 50, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 98, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 4, 4, 4, 4, 4, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0
			};
            
            memset(stagedatex21[8], 0, sizeof(stagedatex21[8]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[8][i] = Data[i];
            }
        }

        {
            const byte Data[135] = {
				7, 4, 1, 0, 0, 0, 0, 0, 0, 1,
				2, 1, 0, 1, 1, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				7, 0, 0, 0, 0, 0, 1, 98, 1, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 98,
				0, 0, 0, 0, 0, 0, 1, 98, 0, 0,
				0, 2, 0, 0, 2, 0, 0, 2, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
				1, 2, 1, 0, 0, 0, 0, 0, 0, 0,
				0, 4, 4, 4, 4, 4, 4, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0
			};
            
            memset(stagedatex21[9], 0, sizeof(stagedatex21[9]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[9][i] = Data[i];
            }
        }

        {
            const byte Data[134] = {
				0, 0, 0, 0, 0, 0, 4, 0, 0, 80,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 80, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 4, 0, 0, 0, 4, 0,
				7, 7, 7, 7, 7, 40, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				4, 4, 4, 4, 4, 4, 4, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 83, 0,
				0, 0, 0, 0
			};
            
            memset(stagedatex21[10], 0, sizeof(stagedatex21[10]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[10][i] = Data[i];
            }
        }

        {
            const byte Data[134] = {
				0, 0, 0, 0, 54, 0, 4, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 4, 4, 0, 0, 0, 4, 4,
				0, 0, 0, 0, 0, 41, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 40, 0, 0, 4,
				4, 4, 4, 4, 4, 4, 4, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0
			};
            
            memset(stagedatex21[11], 0, sizeof(stagedatex21[11]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[11][i] = Data[i];
            }
        }

        {
            const byte Data[135] = {
				0, 0, 0, 7, 7, 7, 7, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 81, 98, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 81, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
				0, 50, 0, 50, 0, 0, 51, 0, 0, 0,
				0, 0, 0, 0, 0, 0, 0, 0, 81, 0,
				0, 0, 4, 4, 4, 0, 0, 0, 4, 4,
				0, 0, 0, 0, 0, 41, 0, 0, 0, 0,
				0, 50, 0, 50, 0, 0, 41, 0, 4, 4,
				4, 4, 4, 4, 4, 4, 4, 0, 0, 0,
				0, 0, 0, 4, 81, 0, 0, 0, 0, 0,
				0, 0, 0, 0, 0
			};
            
            memset(stagedatex21[12], 0, sizeof(stagedatex21[12]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[12][i] = Data[i];
            }
        }

        {
            const byte Data[145] = {
				5, 5, 5, 0, 0, 0, 0, 5, 5, 5,
				5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
				5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
				5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
				0, 0, 0, 5, 5, 5, 5, 5, 5, 5,
				5, 5, 5, 5, 0, 0, 0, 5, 5, 5,
				5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
				5, 5, 0, 0, 0, 0, 0, 5, 5, 5,
				5, 5, 5, 5, 5, 0, 0, 0, 5, 5,
				5, 5, 5, 5, 0, 5, 5, 5, 5, 5,
				5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
				5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
				5, 5, 5, 5, 5, 5, 5, 5, 5, 5,
				5, 5, 5, 5, 5, 5, 5, 0, 5, 5,
				5, 5, 5, 5, 5
			};
            
            memset(stagedatex21[13], 0, sizeof(stagedatex21[13]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[13][i] = Data[i];
            }
        }

        {
            const byte Data[150] = {
				6, 6, 6, 0, 0, 0, 0, 6, 6, 6,
				6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
				6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
				6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
				0, 0, 0, 6, 6, 6, 6, 6, 6, 6,
				6, 6, 6, 6, 0, 0, 0, 6, 6, 6,
				6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
				6, 6, 0, 0, 0, 0, 0, 6, 6, 6,
				6, 6, 6, 6, 6, 0, 0, 0, 6, 6,
				6, 6, 6, 6, 0, 6, 6, 6, 6, 6,
				6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
				6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
				6, 6, 6, 6, 6, 6, 6, 6, 6, 6,
				6, 6, 6, 6, 6, 6, 6, 0, 6, 6,
				6, 6, 6, 6, 6, 6, 0, 0, 0, 0
			};
            
            memset(stagedatex21[14], 0, sizeof(stagedatex21[14]));
            for(int i = 0; i < sizeof(Data); ++i)
            {
                stagedatex21[14][i] = Data[i];
            }
        }

        memset(stagedatex21[15], 0, sizeof(stagedatex21[15]));


        BlockSubType[BlockCount] = EBlockSubType::ITEM_BLOCK_MUSHROOM_4; //nブロック[nブロックco].xtype = 4;
        BlockCreate(348, 249, EBlockType::ITEM_BLOCK_MUSHROOM);
        int t_9 = GroundCount;
        GroundX[t_9] = 8700; //n地面[t_9].a = 8700;
        GroundY[t_9] = 36500; //n地面[t_9].b = 36500;
        GroundSizeX[t_9] = 11999; //n地面[t_9].c = 11999;
        GroundSizeY[t_9] = 3000; //n地面[t_9].d = 3000;
        GroundType[t_9] = EObjectType::FALLING_FLOOR; //n地面[t_9].type = 52;
        GroundCount++; //n地面co++;
        for (int num34 = 0; num34 <= 1000; num34++)
        {
            for (int num35 = 0; num35 <= 16; num35++)
            {
                stagedate[num35][num34] = stagedatex21[num35][num34];
            }
        }
    }
}
